[{"title": "Whoever created the tradition of not seeing the bride in the wedding dress beforehand saved countless husbands everywhere from hours of dress shopping and will forever be a hero to all men.", "text": "Damn... this got big..."},
{"title": "If EA suffers big enough losses from the backlash of Battlefront 2, and it all started because some guy couldn't unlock Vader, this will be the second time Anakin brought balance to something.", "text": "Edit: Since people keep asking. Spoilers for a 30+ year old movie ahead: Anakin brought balance to the force in two ways (depending on interpretation, pick one or the other). He killed off the Jedi until there were only 2 Jedi and 2 Sith, so balanced in a way. Or, in a different interpretation, this action distabilized the Force since the Sith had more control over the universe. The action that brought balance to the Force was when he, as Vader, killed Palpatine. As u/Sarahneth mentioned, he also brought balance to his pod racer as well, if we're being very literal."},
{"title": "Anxiety is like when video game combat music is playing but you can't find any enemies.", "text": ""},
{"title": "Being able to do well in high school without having to put in much effort is actually a big disadvantage later in life.", "text": ""},
{"title": "Girls don't compliment guys because they're likely to take it non-platonically, guys take it non-platonically because it happens so infrequently they don't know how to handle it", "text": ""},
{"title": "11 babies have been born in Antarctica, and none of them died as infants, meaning Antarctica has the lowest infant mortality rate at 0%", "text": ""},
{"title": "Somebody at google was just like \"yea, just have someone drive down every road on fucking earth\".", "text": "And you know what? They did it."},
{"title": "College students don't want to go to graduation ceremonies, but they go to please their relatives, while relatives don't want to go but go to support the students; we should all just be honest and skip that ceremony and go out for pizza.", "text": ""},
{"title": "The sentence \"Don't objectify women\" has \"women\" as the object of the sentence.", "text": ""},
{"title": "Apparently, a lemon is not naturally occurring and is a hybrid developed by cross breeding a bitter orange and a citron. Life never gave us lemons; we invented them all by ourselves.", "text": ""},
{"title": "Being 35 and not wanting to work in the field for which you've prepared is like being half way through an RPG and realizing you've built out your skill tree all wrong and you can't respec and you can't make a new character and there will never be another video game again", "text": ""},
{"title": "It kinda makes sense that the target audience for fidget spinners lost interest in them so quickly", "text": "Edit: Apparently, people have a lot of feelings on fidget spinners. Strong feelings."},
{"title": "A guy named \"Weird Al\" has had a 40+ year long career with no allegations of sexual impropriety.", "text": ""},
{"title": "The olympics is the only time when you hear \"Great execution by North Korea\" and it seems okay.", "text": "EDIT: Thanks for the Gold! Seems fitting for an Olympics Shower Thought."},
{"title": "Since there are 3600 seconds in an hour, and most people make less than $36.00/hr, their time is worth less than a penny per second. It's literally worth your time to pick up a penny from the ground.", "text": ""},
{"title": "Security at every level of an airport is absolutely ridiculous. Until you get to the baggage claim. Then it’s just like take whatever bag you want.", "text": ""},
{"title": "If we look back, Pornhub has been one of the most innovative video sharing websites. They have had permanent dark mode for years, they popularized the preview setting where you can watch the video without starting it, and still are one of the few to have like/dislike percentage on display", "text": ""},
{"title": "Avatar, the highest grossing film of all time, seems to have made zero impact on culture. No one references the movie and no one really talks about it since it was released 10 years ago.", "text": ""},
{"title": "In the anime, Ash Ketchum was supposed to be a huge Pokémon fan before he left on his journey. But every time he sees any kind of Pokémon, he has to pull out his Pokédex because he doesn’t know what it is. Ash Ketchum was a poser before he left on his journey.", "text": ""},
{"title": "This \"Spring Forward\" thing would be a lot more popular if we moved the clocks ahead at 2PM on Monday.", "text": ""},
{"title": "Stan Lee’s funeral is going to be a reverse cameo where all the superheroes appear in the background of his story", "text": ""},
{"title": "The syllables in “on your mark, get set, go” are a countdown", "text": ""},
{"title": "The spiders that live in Buckingham Palace now are probably the descendants of the spiders that lived there during Victorian times - it's a whole parallel royal family but with spiders", "text": "Amirite? "},
{"title": "The internet both almost killed off the postal service with email and then made it more needed than ever with online delivery", "text": ""},
{"title": "Tinder is the opposite of porn site advertisements. There actually are a ton of hot singles in my area, but none of them are interested in me.", "text": ""},
{"title": "One of the most frustrating feelings in the world is being smart enough to know there’s a better way to do something but not smart enough to invent a way to do it.", "text": ""},
{"title": "Watching a graduation ceremony is like sitting through a movie thats entirely end credits", "text": ""},
{"title": "Google earth is one of the most incredible things ever created by man but is taken for granted as if it were nothing.", "text": "Think about it "},
{"title": "In the Harry potter universe, couples could take polyjuice potion and swap bodies then have sex to see what it's like from both perspectives.", "text": ""},
{"title": "It must suck to be an air conditioner repairman. You spend your day working in buildings that have no air conditioning. When it's fixed and finally cool, you leave.", "text": ""},
{"title": "The fact that the death of a scientist is headline news worldwide is in some ways the most fitting tribute Stephen Hawking could possibly have.", "text": ""},
{"title": "Both sexes can fuck a Pringles can, but neither can do it well.", "text": ""},
{"title": "There is no physical evidence to say that today is Wednesday, we all just have to trust that someone has kept count since the first one ever.", "text": ""},
{"title": "Your future self is talking shit about you", "text": ""},
{"title": "The first person who inhaled helium must have been so relieved when the effects wore off", "text": ""},
{"title": "At the age of 60, Snoop Dogg will be 420 in dog years", "text": "Wow I never expected this to blow up, thanks for the upvotes guys ! Hopefully Snoop Dogg or /u/Here_Comes_The_King will see this someday !\n\n\nAlso Happy New Years !\n\nEdit: Thanks strangers for the gold !\n\n\n"},
{"title": "When people brokenly speak a second language they sound less intelligent but are actually more knowledgeable than most for being able to speak a second language at all.", "text": ""},
{"title": "Sunny D tastes like someone made a bet that they could make orange juice without oranges", "text": ""},
{"title": "Telling a dangerously overweight person not to lose weight because they're beautiful is like telling an alcoholic not to stop drinking because they're fun.", "text": "Disclaimer: being \"overweight\" doesn't matter to me and I don't hate people who are. However, there is a point where your weight is seriously endangering your health.\n\n\nEdit: Thanks for the gold! I didn't expect this to be so popular.\n\n\n\nEdit II: the point I'm trying to make is that in both cases it is wrong to encourage unhealthy behaviors under the guise of support or because you enjoy the effects of the dangerous behaviors. \n\nNot only that, but you're basically saying they aren't fun unless they drink and they aren't beautiful unless they're overweight.  You're completely disregarding their health and quality of life. Body positivity should mean you're beautiful no matter what size and we shouldn't equate ANY weight with beauty. Weight should be about health only. \n\nYou also shouldn't be a jerk to someone because of their weight. "},
{"title": "The tallest person in the world has physically experienced being the exact height of every other person in the world at some point", "text": ""},
{"title": "Being an adult is eating the crust not because you like it, but because you paid for it.", "text": ""},
{"title": "When medication says \"do not operate heavy machinery\" they're probably mainly referring to cars, but my mind always goes to forklift.", "text": ""},
{"title": "Running from the cops is the ultimate double or nothing.", "text": ""},
{"title": "Replying \"k\" in morse \"-.-\", has the same passive aggressive tone", "text": ""},
{"title": "A person wearing a suit in a room of people in t-shirts is usually the most important person there, a person wearing a t-shirt in a room full of suits is more likely the most important person in the room", "text": ""},
{"title": "USPS could make more money if they put post offices in airports so instead of throwing something out that you forgot was in your bag you could mail it home.", "text": ""},
{"title": "Anybody that questions why you are shoveling six inches of snow in the *middle* of a snowstorm hasn't shoveled twelve inches of snow at the end of a snowstorm.", "text": ""},
{"title": "The average car in space is nicer than the average car on Earth", "text": ""},
{"title": "Both concrete and glass are mostly made of sand which makes skyscrapers just really tall sandcastles", "text": ""},
{"title": "Single Player games that don’t require internet are going to be extremely valuable during the apocalypse", "text": ""},
{"title": "Maybe little kids have it right when they worship the garbage man, the postman, the guy who drives the semi and cranes, instead of admiring the cesspool of Hollywood that we adults seem to.", "text": "I hope it is not in bad form to name a kindly benefactor, but thank you /u/goat_chortle for the ~~guilding~~ gilding!\n\nEdit> Oops! thanks for the correct spelling of gilding /u/idlevalley"},
{"title": "We're lucky that our bodies require sleep, otherwise our cultures would have us working 16-20 hour days.", "text": ""},
{"title": "It would be weird if a human yelled out \"Anyone wanna fuck?\" but birds do it all day and nobody cares.", "text": ""},
{"title": "If wookies have a 400 year life span, then Han Solo is basically like Chewbacca's third dog", "text": ""},
{"title": "Social anxiety is basically Conspiracy Theories about yourself.", "text": ""},
{"title": "Google Earth, in all its detail, is an unprecedented accomplishment for mankind. No one even a hundred years ago (or less) would believe it could exist. But the fact that it is free, is a world wonder.", "text": ""},
{"title": "If you won the award of the first man to break two world records, that would make it 3 awards, and you win the award of first man to break 3 records, now you have infinite awards", "text": "edit: thanks for the gold random internet people"},
{"title": "\"Bob's Burgers\" would also be an appropriate title for SpongeBob SquarePants.", "text": ""},
{"title": "If you play the PornHub community jingle in public, everyone will know you’re watching porn but no one will say anything because it will reveal that they know what the jingle’s from", "text": "Edit: I did not expect this to blow up. Thank you for the silver kind strangers! And also the gold!"},
{"title": "If you are alone when you crack open a peanut shell and eat the peanut inside, you are the only person in the world to have ever seen that peanut.", "text": ""},
{"title": "The movie industry considers you to be an adult when you're 17 to see a rated R movie, but they conveniently lower that age to 13 when they are deciding who pays adult ticket prices.", "text": ""},
{"title": "Dr. Strange is a movie about the importance of saving before a final boss.", "text": ""},
{"title": "There is nothing better than realizing, right after you wake up, that you won't have to face repercussions for the terrible choices you made in your dream.", "text": ""},
{"title": "It’s entirely possible that two random people on the internet have had a friendly conversation on one forum and later an aggressive hateful conversation on another forum, without ever knowing of their previous wholesome interaction.", "text": ""},
{"title": "The other day, someone said, \"Newton's rolling over in his grave\" in response to a basic physics mistake. But if Newton heard someone suggest his corpse could move without an external force acting upon it, he would roll over in his grave.", "text": ""},
{"title": "Condoms are made by automated assembly lines, meaning robots are literally helping to prevent human reproduction.", "text": ""},
{"title": "If race horses could comprehend that victory meant a lifetime of leisure and sex they’d probably run even faster", "text": ""},
{"title": "In one generation we went from, \"watch your mouth around grandma, she's from a different time,\" to, \"Don't mind all the stuff grandma says, she's from a different time.\"", "text": ""},
{"title": "The Viagra commercial always says \"Make sure your heart is healthy enough for sex.\" That's a really deep question if you think about it in more of a metaphorical way", "text": ""},
{"title": "Too bad alcohol isn't heavily discounted the day after St. Patrick's Day the way candy is after Valentine's Day.", "text": ""},
{"title": "College Students are simultaneously stereotyped for not getting enough sleep and for sleeping all the time.", "text": ""},
{"title": "Pinterest is like a virus that infected the google image search.", "text": "And it’s spreading!\n\n\n\n\n\n\nEDIT: Thank you for gold kind stranger! My first gold ever! \n\n"},
{"title": "Amish girls have no way of knowing if it's a romantic candlelit dinner or just a regular dinner", "text": ""},
{"title": "If everyone on earth died simultaneously, the internet would be comprised entirely of bots posting, liking, and upvoting each other.", "text": ""},
{"title": "You know who has more descendents than Genghis Khan. Genghis Khan's dad.", "text": ""},
{"title": "Quitting cable news is like quitting smoking. After a year without you see how disgusting it really is.", "text": ""},
{"title": "Given that tickling yourself does not work the same as someone else tickling you, we really lucked out with masturbation.", "text": ""},
{"title": "Posting newborn’s weight and length makes childbirth rather too similar to fishing", "text": ""},
{"title": "One of the worst feelings is the feeling of your sleeves sliding down you wrists as you wash your hands", "text": "I hate when this happens because then your sleeves get all wet"},
{"title": "Being an adult is like one of those choose your own adventure stories but every option sounds terrible and costs way too much", "text": ""},
{"title": "Deciding to become a parent is like choosing to take care of a a drunk person for 13 years straight, and a hungover person for the next 5. Then paying for their rehab for the next 4.", "text": ""},
{"title": "The first time someone steals a spaceship and flies away is going to be epic.", "text": ""},
{"title": "Inside every 85 year old man is an 18 year old saying what the fuck just happened.", "text": ""},
{"title": "Referring to your employees as \"family\" is the corporate equivalent to telling a prostitute you love her.", "text": ""},
{"title": "Being lonely is believing you've received a message when it's just your battery at 15%", "text": ""},
{"title": "You could throw a rock into a lake and be the last person to ever touch that rock until the end of time", "text": "Edit: Holy crap first front page and gold! Thanks everyone!"},
{"title": "We all joked that Hollywood wasn’t giving Leonardo Di Caprio an Oscar so he would keep making great movies, and he hasn’t been in one since he won his Oscar.", "text": ""},
{"title": "If you’re no longer covered by your parent’s health insurance, your manufacturer’s warranty is over.", "text": ""},
{"title": "Due to it almost only being populated by researchers, Antartica is technicaly the continent with the highest average IQ and education.", "text": ""},
{"title": "The fatter you are, the better chance you have at winning in 'Spin the Bottle'", "text": ""},
{"title": "If Centaurs were real, the bottom half would start walking around immediately after being born, while the top half would be all floppy for the first two years.", "text": ""},
{"title": "Comic Con is the best way to see what your favorite characters would look like if they let themselves get out of shape.", "text": ""},
{"title": "Tom and Jerry is one of the most distinct case of child v.s. adult perspective in which as a child you think Jerry is witty and correct but as an adult you see that Tom is being bullied by Jerry whilst attempting to live his life as a normal house cat.", "text": ""},
{"title": "At a certain point in your life, sitting at home alone, watching TV on a Friday night goes from being super depressing to the most enjoyable part of your week.", "text": ""},
{"title": "Our parents warned us for years about the 'dangers' of the internet while knowing nothing about it, then finally dove in and fell for every. Single. One.", "text": ""},
{"title": "Peer pressure as an adult is seeing your neighbor mow their lawn.", "text": ""},
{"title": "Bottled water companies do not produce water, they produce plastic bottles.", "text": "Edit: cant believe i reached the top of r/all and the number 3 post on ShowerThoughts this week and still no gold 😤😤. In awe at the size of this lad of a post. Absolute unit. Great job everyone.\n\nEdit edit: thank you kind stranger"},
{"title": "Imagine how rich you would have had to be 200 years ago to have music playing in the background while you cook dinner", "text": ""},
{"title": "When we're young, we sneak out our house to go to parties. When we're old, we sneak out of parties to go home.", "text": ""},
{"title": "Male country singers talk about how good they are to women, while female country singers talk about how terrible the men are.", "text": ""},
{"title": "The Kardashian family is made up of a man who transformed into a woman (Tiresius), sisters who so ravenously crave attention they'll do anything to get it (Harpys), and a mother slowly turning to stone due to plastic surgery (Niobe). The Kardashians are Greek myths come to life for the 21st century.", "text": ""},
{"title": "If you think you ever fucked up bad, just remember somewhere an ant brought borax laced food to the colony killing the queen and the colony", "text": "EDIT: thanks for the insane amount of upvotes. "},
{"title": "Pirates have always seemed good about employing people with physical disabilities.", "text": "Hook hands and peg legs are iconic for them. And they seem to frequently be in the middle to high levels of management.\nEdit: Thank you for gold! It's my first time!"},
{"title": "Instead of a Mummy’s Curse, in a couple hundred years when archaeologists are sitting through data on old computers, someone’s accidentally going to unleash an ancient computer virus into their network", "text": ""},
{"title": "In 10-15 years gamer dads will join the sports dads who \"could've gone pro if it werent for.......\"", "text": ""},
{"title": "There must be millions of people who still spell out B-E-A-UTIFUL in their head the same way Jim Carrey did in Bruce Almighty.", "text": ""},
{"title": "That \"No alcohol beyond this point\" might as well say, \"Bet you can't chug that whole beer.\".", "text": ""},
{"title": "Knowing you have the next day off is more relieving than the actual day off", "text": ""},
{"title": "One day Rick Astley will die and no one will click on the headline.", "text": ""},
{"title": "If humans were ever to prove the theory that our universe is a simulation, it would simultaneously become the moment when artificial intelligence becomes self-aware, ironically making humanity the artificial intelligence all along.", "text": ""},
{"title": "A college class is like Dora the Explorer. The professor asks a question, stares blankly for a few seconds, then answers his own question.", "text": ""},
{"title": "There's probably some women out there whose children secretly belong to the wrong man and are freaking out about the fact that people are taking DNA tests for fun.", "text": ""},
{"title": "When you walk through a grocery store and they are playing good music. You have become their target demographic.", "text": ""},
{"title": "People with anxiety are basically way too aware of being alive", "text": ""},
{"title": "As a kid, you are bullied by people who don't like you, and your friends are nice. Once you're older, you're bullied by your friends, and people who don't like you are nice", "text": ""},
{"title": "Knowledge is knowing that you can carry all of the groceries in at once. Wisdom is making multiple trips so that by the time you are done, other family members have put away most of the groceries.", "text": ""},
{"title": "You know you've reached adulthood when your bed is in the middle of the wall instead of in the corner.", "text": ""},
{"title": "It's surprising there aren't any conspiracy theories that the ocean is bottomless because most people have never been to the seafloor.", "text": ""},
{"title": "If women were the ones with the ballsack, there would be so many bogus scrotal beautification products like special braces and wraps to keep it tight and smooth as you age.", "text": "Edit: Just because I wrote something about ballsacks doesn’t mean I’m a man. \n\nI’m not trying to imply women are more superficial than men, just that there’s a lot of unnecessary, bogus products targeted towards us. I also understand there are women with ballsacks, but was trying to keep it short to the point here about gendered expectations. I came here to express a brief shower thought and now I’m halfway through an essay. All the funny is gone!\n\n But thank you for the Dave Chappell bit, had never seen it before and it made my day."},
{"title": "A shark eating a human thinking it’s a seal is the equivalent of a human eating a raisin cookie thinking it was chocolate chip", "text": ""},
{"title": "A different version of you exists in the minds of everyone who knows you.", "text": ""},
{"title": "A 3 day break, you feel well rested. A 5+ day break, you forget how to be a productive member of society.", "text": ""},
{"title": "Fahrenheit is basically asking humans how hot it feels. Celsius is basically asking water how hot it feels. Kelvin is basically asking atoms how hot it feels.", "text": ""},
{"title": "The hardest thing to believe about Batman is that not 1 distant relative tried claiming him in order to inherit the Wayne fortune.", "text": "Edit: I go to dota and come back to this shit?"},
{"title": "Ouija boards would be much scarier if they weren’t made by Hasbro and instead were the only product of an obscure, 300 year old company located in a remote village in eastern Europe", "text": ""},
{"title": "People who post pictures of restaurant menus on Yelp when you can't find them anywhere else are the real MVPs.", "text": ""},
{"title": "When you think about it, Shakespeare WAS the result of billions of monkeys trying to write stuff randomly for millions of years.", "text": "The monkeys just eventually turned out to be *us*."},
{"title": "There are probably a bunch of parents who think their children are fussy eaters, when in reality they're just horrible cooks.", "text": ""},
{"title": "Apple treats you like a user, Android treats you like an admin.", "text": ""},
{"title": "Crispy is just crunchy but thin.", "text": ""},
{"title": "If penis size was as obvious as breast size the world would be a very different place.", "text": ""},
{"title": "Amputating Mike Wazowski’s legs would be exactly the same as beheading him.", "text": ""},
{"title": "Being a pet owner is like being a sugar daddy. You waste all of your money on keeping them happy, and the only thing they do is look cute and give you attention sometimes.", "text": ""},
{"title": "If you put a map of your country on the floor, there will be a point on the map that is touching the actual point it refers to", "text": ""},
{"title": "8 hours of drinking is binge drinking, 8 hours of TV is binge watching, 8 hours of sleep is barely enough", "text": ""},
{"title": "If Apple manufactured clothing they'd probably have all the belt loops on their jeans a different size than normal, so you'd also have to buy an Apple Belt.", "text": ""},
{"title": "If reincarnation is real, then maybe flies and other bugs are purposely annoying because they want to get killed and get reincarnated as something better", "text": ""},
{"title": "Eating lunch alone as a kid is like torture, getting to eat lunch alone as an adult is a nice treat.", "text": ""},
{"title": "If I see Google in a show/movie I think nothing of it, but if I see Bing, I know it's product placement.", "text": ""},
{"title": "The fact that a blood red lunar eclipse is happening only a week after they opened that black sarcophagus in Egypt is kinda unsettling.", "text": ""},
{"title": "If you run at 11pm you are a night person. If you run at 5am you are a morning person. If you run at 3am you are a suspicious person.", "text": ""},
{"title": "The only part of your reflection you can lick is your tongue.", "text": ""},
{"title": "“Lazytown” was a show in which the protagonists promoted health and criticized unhealthy behavior, such as being on the internet all the time. Now the antagonist of the show is an icon to those who browse the internet all day", "text": ""},
{"title": "A gold fish's job is to introduce kids to dying", "text": "Yes, I know that some can live a long time but a lot of them don't"},
{"title": "When you choke on water, you’ve failed at breathing and drinking, the two most important activities in your life.", "text": ""},
{"title": "If aliens are monitoring our media and 98% of the internet is porn...They're not giving us anal probes; they're just trying to speak the language.", "text": ""},
{"title": "For every girl who wonders if a guy is staring at her, there is a guy who accidentally makes eye contact and is now afraid that she thinks he was staring at her.", "text": ""},
{"title": "Airports should have small movie theaters for layovers. They would make a killing.", "text": ""},
{"title": "People who say not to talk to them before their morning coffee are basically saying that they're unpleasant to be around when they're not under the influence of drugs", "text": ""},
{"title": "When you introduce two different groups of friends to each other, it's like your own life's crossover episode.", "text": ""},
{"title": "The only people forced to see anti-piracy warnings are the people who don't pirate movies.", "text": ""},
{"title": "It’s weird to think that nighttime is the natural state of the universe, and that daytime is only caused by a nearby, radiating ball of flame", "text": ""},
{"title": "I'm lucky to be broke at a time when minimalism and sustainability are in style.", "text": ""},
{"title": "A guy can decline an invitation by saying his girlfriend won't let him go and everyone will likely understand. But if a girl declines an invitation by saying her boyfriend won't let her go, people will likely get concerned.", "text": ""},
{"title": "Having kids is like having little broke bestfriends that think you're rich", "text": ""},
{"title": "\"Based on a true story\" movies are all part of the same series.", "text": ""},
{"title": "Shrek says “hold the phone” even though telecommunication does not seem apparent within the Shrek universe.", "text": ""},
{"title": "smelling your own fart puts that fart back inside of you", "text": ""},
{"title": "With how many streaming services there are it won’t be long before someone bundles them all together and we end up with Cable TV again.", "text": ""},
{"title": "Rockstar has really proven with their popular games GTA V and Red Dead Redemption 2 that we have never really outgrown playing cops and robbers or cowboys and Indians", "text": ""},
{"title": "Witch hunting wouldn't have been so popular in medieval times if any of the victims were actual witches and had decided to fight back", "text": ""},
{"title": "Parents who say, \"If you're feeling well enough to play video games, you're feeling well enough to go to school!\" don't seem to realize they are equating an extremely low impact leisure activity with a high stress and difficult involuntary obligation.", "text": ""},
{"title": "The Onion might go bankrupt because they can't compete against the reality now", "text": ""},
{"title": "Water is a beverage whose flavor is its temperature.", "text": ""},
{"title": "Star-Lord from the Guardians of the Galaxy movies probably still thinks Santa is real. He was taken from Earth as a kid and then raised in space around aliens and crazy creatures the rest of his life. He probably assumes Santa is an alien.", "text": ""},
{"title": "Making a typo in an online argument is the equivalent of voice cracking in a verbal argument.", "text": ""},
{"title": "With Jeff Bezos having $116.8 billion and the average person having 100 billion brain cells, Jeff Bezos literally has more money than sense.", "text": ""},
{"title": "An underrated perk of being an adult is you no longer outgrow your clothes.", "text": "Well... Unless you get fat."},
{"title": "Kids today will never know that unique smell of Blockbuster which was kinda like a mixture of candy and carpet.", "text": ""},
{"title": "The main child actors in Harry Potter were tutored on set so they theoretically went to school at Hogwarts", "text": ""},
{"title": "\"Send nudes, not nukes\" is the \"make love, not war\" of this century", "text": ""},
{"title": "Harry Potter is way too emotionally stable for a kid raised by a family who hates him.", "text": ""},
{"title": "If phones warned that listening at a high volume may cause damage to headphones instead of hearing, more people would probably keep their volume lower.", "text": ""},
{"title": "The more bad guys that a hero is facing in a movie, the better their chance of survival; 1v5 is no problem but 1v1 will see the hero messed up pretty bad.", "text": ""},
{"title": "Kanye West probably thinks he is a genius because he spends most his time with the Kardashians.", "text": ""},
{"title": "People who make advertisements for girls' toys don't seem to have any idea how girls play with them. Barbies don't have nice civilised tea parties and talk about boys, it's more like Game of Thrones except everyone is a lesbian", "text": "ITT: Girls saying \"yeah we totally did that\" and guys saying \"wtf girls never do that\""},
{"title": "People often forget that there was a time before glasses, which explains many historical myths and legends.", "text": ""},
{"title": "The CEO of Starbucks technically runs one of the worlds largest drug empires", "text": ""},
{"title": "Waterboarding at Guantanamo Bay sounds super rad if you don't know what either of those things are.", "text": ""},
{"title": "If you have a bachelor's degree in science or engineering, you have as much formal science education as Bill Nye. You are officially a Science Guy.", "text": "Quick edit since I wrote this post in 5 seconds in between bites of a bagel thinking I'd get 2 karma:\n\n1) Not a jab at Nye at all. He's a reminder that it's possible to have a huge positive impact on scientific progress without a bunch of fancy initials after your name.\n\n2) Science Guys, Gals, or anything outside or in between, Nye and I think you're all great!"},
{"title": "Your dog thinks \"fetch\" is a game that the two of you made up, and he loves you for that", "text": ""},
{"title": "When we sleep, our brains have enough power to generate its own reality in dreams. When we’re awake, it doesn’t have enough power to remember why we walked into a room.", "text": ""},
{"title": "We have no problem wearing the same socks all day, but once they come off for one second, it’s gross to put them back on.", "text": ""},
{"title": "Our brain constantly calculates possible futures and forgets about them immediately. Maybe deja vu is just our brain remembering the calculation and is surprised about actually having predicted the future.", "text": ""},
{"title": "There should be a reality show where flat-earthers have to find the edge of the world.", "text": ""},
{"title": "By always blaming Millenials, we are showing that our generation (which raised them) doesn't take responsibility for our problems.", "text": ""},
{"title": "In the Harry Potter universe, where paintings and images can interact with those looking at them, \"waifu pillows\" are probably a lot more interesting.", "text": ""},
{"title": "The Nordic people went from being the most feared and hardcore raiders,to being the nicest and politest people in Europe", "text": ""},
{"title": "When you cannot sleep because you can’t stop thinking about something it’s like a single program not letting the computer shut down", "text": ""},
{"title": "There should be a millenial edition of Monopoly where you just walk round the board paying rent, never able to buy anything.", "text": "Credit - @mutablejoe "},
{"title": "The super-rich have fast cars, private jets, many large homes, exclusive designer fashion, live-in chefs, original artworks, and the same phone as you.", "text": ""},
{"title": "Pets are \"the 1%\" of animals.", "text": ""},
{"title": "Soon games will advertise \"No DLC/Microtransactions\" just like food advertises \"No trans fats\"", "text": ""},
{"title": "Being a blacksmith must have been a real pantydropper back in the day seeing how Smith is the most common surname today.", "text": ""},
{"title": "Today, millions of children will ring the door bells of countless real life murderers, rapists and drug dealers.", "text": ""},
{"title": "If boys screamed at girl bands the way girls scream at boy bands it would be terrifying and hilarious", "text": "Edit: OK we're on front page. To all you folk talking about j and k and w-pop that just sounds a bit too organised and controlled (they chant etc) I'm talking about channeling those screaming duck toys here, no control, no end - Luke what stopped the Beatles from performing but men\n\nEdit ii: well I don't want to watch a bunch of k-pop, maybe I'm wrong- the one I watched wasn't crazy enough to satisfy me\n\nEdit iii: whatever-pop\n\nEdit iv: Jesus Christ enough with the \"you've never heard of kjw-pop/ been to Japan or Korea comments\" i get it jeez! who knew there were so many dads on reddit"},
{"title": "Adulthood is understanding why Shrek just wanted to be left alone.", "text": ""},
{"title": "This is not the year for mistletoe in the workplace.", "text": ""},
{"title": "Accidentally liking someone's post while snooping through their profile is the digital equivalent of stepping on a twig while sneaking through the forest.", "text": ""},
{"title": "As a graphic designer, my entire career exists because I was able to pirate Photoshop 10 years ago.", "text": ""},
{"title": "Harry Potter could have been hallucinating everything due to carbon monoxide poisoning by being stuck in the cupboard under the stairs.", "text": ""},
{"title": "Before the internet, nerds and fanboys were getting bullied. After the internet, nerds and fanboys became the bullies.", "text": ""},
{"title": "Everyone’s talking about Baby It’s Cold Outside being offensive when Santa Baby is basically about a girl whoring herself out to Santa for expensive gifts.", "text": ""},
{"title": "Our belly buttons are basically the same thing as holes the in fruit, where the stem goes.", "text": "RIP typo :-\\\n\nEdit: What! this thing blew up! x2 gold x3 silver thanks kind internet strangers! :-)"},
{"title": "Mark Zuckerberg used to be a hero of the digital age, but now he has lived long enough to see himself become the villain.", "text": ""},
{"title": "Baby gates are the exact equivalent to - This area is locked until you’ve gained more experience.", "text": ""},
{"title": "In the wizarding world, rappers would be the hardest to battle. Imagine how fast they could cast multiple spells.", "text": ""},
{"title": "When you sit on the toilet you connect your butthole up to the large network of connected buttholes", "text": ""},
{"title": "The first humans sent on a voyage to another solar system might be greeted by humans who were sent later using faster space ships.", "text": ""},
{"title": "Old trailers did not do the movies justice. New movies do not do the trailers justice.", "text": ""},
{"title": "Earth is a dinosaur planet, and humans are just mutants left over after the apocalypse.", "text": ""},
{"title": "If you're 25 and single in 2018, nobody bats an eye. If you're 25 and single in 1818, people worry you'll die an old maid. If you're 25 and single in 1418, it's because your third husband just died of the plague.", "text": ""},
{"title": "Clark Kent would be outed as Superman pretty fast if he ever accidentally pushed a pull door.", "text": ""},
{"title": "Parents begging for grandchildren have the same mentality as a child begging for a puppy: they get all of the cute with none of the work.", "text": ""},
{"title": "They say with pessimism you'll either be correct or pleasantly surprised, but that’s an awfully optimistic way to see pessimism.", "text": ""},
{"title": "By law our cars have to be road worthy, but the roads don’t have to be car worthy", "text": ""},
{"title": "We joke that birdsong is just a pretty way of birds shouting at each other for sex, but really that's all most of our pop music is anyway.", "text": ""},
{"title": "Thor Ragnarok is really about how nothing brings together two siblings like ganging up on the third one", "text": ""},
{"title": "People that wait until they’re married to have sex only have sex with people in their family.", "text": ""},
{"title": "Shrek may unintentionally have the most realistic message of all animated films in that, \"regardless of inner beauty, people will probably end up with someone who matches them outwardly.\"", "text": ""},
{"title": "Honey is totally underrated. Its the only natural food that's made without destroying any kind of life. It's also the only food that won't rot.", "text": ""},
{"title": "In 'Bohemian Rhapsody' a key point was that radio stations would never play a 6:00 song, because listeners wouldn't want to sit through it. Yet in the movie they never play the whole song, probably because they felt audiences wouldn't want to sit through it.", "text": ""},
{"title": "It's 2019, and not one cereal company has created zip-locked bags for the cereal", "text": "(In Australia anyway ...)"},
{"title": "Ethics is the condom of life. It’s a lot more fun without it, but you know better.", "text": "EDIT: \n\nSo that’s what people mean by RIP my inbox....\n\nEDIT 2:\n\nThanks to the kind strangers that decided to gild me!\n\nU/FelixTheFRCat happy now?"},
{"title": "Studying physics is essentially being taught a simple structure, and then told ”actually, scratch that, the truth is actually far more complicated” over and over again until we reach the point where we still don’t know the truth, only that we do not have it.", "text": ""},
{"title": "At -40 we are all on the same page, it's cold as fuck and even fahrenheit and Celsius can't be bothered arguing for a moment.", "text": ""},
{"title": "Somebody who thinks that feathers on dinosaurs would suddenly make them not-scary has never been chased by a goose.", "text": ""},
{"title": "The myth about undercover cops being required to disclose that they're undercover cops was definitely started by an undercover cop", "text": ""},
{"title": "The first person to make ice cream probably ate all the ice cream in the world (at the time).", "text": ""},
{"title": "It's a special kind of gratification when the slow car you're stuck behind turns away, and you speed up to show the people behind you that you weren't the one clogging up traffic.", "text": ""},
{"title": "There are about 15.7 million subscribed to this sub. Divided by 365 is 43,013. To about 43k people, happy birthday", "text": "Edit: WOW. Thanks for the gold kind stranger!\n\nAnd I know the math isn’t perfect. Oh no, its not spot on aaaahhhhh"},
{"title": "Most of the trash on the streets is from junk food because people that don't care about their own health aren't going to care about the health of the planet.", "text": ""},
{"title": "UPS will leave a $900 video card on my porch without even knocking but I have to sign for a $10 pizza", "text": ""},
{"title": "The laws that we are supposed to be fully aware of and abide by are so complex that there is an entire profession dedicated to understanding them. One that takes 8 years to master.", "text": ""},
{"title": "If the wizards in Harry Potter really wanted they could create a society with unlimited food, space and energy that could vastly improve Humanity as a whole, instead they just hide like assholes.", "text": "I mean come on, at least donate some magical shit for the Medics Sans Frontier."},
{"title": "Agreeing to terms and conditions went from: \"this is our stuff, don’t copy and sell it\" to \"this is your stuff, we’ll copy and sell it”", "text": ""},
{"title": "For the first 8 minutes of your life the sunlight around you is older than you are", "text": ""},
{"title": "In 20 years or so, I'm going to have to jailbreak my car to drive above the speed limit", "text": ""},
{"title": "Maybe the grass seems greener on the other side because you’re not over there fucking it up.", "text": ""},
{"title": "Me at 8 years old: \"When I grow up no one will tell me when I have to go to bed.\" Me at 33 years old: \"Ooo, there's an app that will analyze my sleep quality and patterns and alert me when my optimal bedtime is approaching.\"", "text": "Edit: For everyone asking, I am using the Pillow app on the iPhone with the Apple Watch companion app."},
{"title": "Ignoring a problem is just like letting it level up before facing you.", "text": ""},
{"title": "Fitbits are just like Tamagotchis, except the stupid little creature you have to keep alive is yourself.", "text": ""},
{"title": "Being \"Jr.\" or \"the Second\" is the real life equivalent of having to put numbers after a username.", "text": "\"I'm John Smith, and this is my son, John Smith Underscore Sixty-Nine.\""},
{"title": "If millenials aren't getting married, eventually they will be blamed for destroying the divorce lawyer market", "text": ""},
{"title": "I hate to spend $6.50 on six pieces of raw chicken, but dont hesitate to spend $5 on one chicken sandwich.", "text": ""},
{"title": "The smell of someone vaping in public is a disturbing reminder of how often we breathe in the same air someone just exhaled", "text": ""},
{"title": "Being attracted to people who wear glasses is the one fetish for physically impared that's socially acceptable", "text": ""},
{"title": "Sleep should be rolled over. Like \"Oh, you got 20 hours of sleep today? Cool man, you don't need sleep for the next three days.\"", "text": ""},
{"title": "Sears started out as a mail-order catalog that would deliver packages right to your door. It was driven to bankruptcy by an internet site that delivers packages right to your door.", "text": "http://www.searsarchives.com/catalogs/history.htm\n\nEdit: Front Page??!!!  For THIS??!!! Wow, and gilded too!!?? Thanks!"},
{"title": "Pixar is the version of Disney that just wants to tell the story without people singing every 10 minutes.", "text": ""},
{"title": "Bill Gates is like a video game character who's unlocked everything. All he can do now is self-imposed challenges like cure malaria to keep things interesting.", "text": ""},
{"title": "The way countries hastily try to fix/hide their social issues before the olympics is essentially an entire country's version of the panicked cleaning up you do around the house when people are about to come over", "text": ""},
{"title": "Holding your breath to get rid of hiccups is like turning your lungs off and on again", "text": "Edit: Ok it’s been well established that saying diaphragm would’ve been more accurate. "},
{"title": "When you're a kid, one teacher walking into another teacher's classroom is the biggest crossover event reality has to offer", "text": ""},
{"title": "I'm not sure if my antivirus software is effective, because no viruses are detected on my computer, or ineffective, because no viruses are detected on my computer.", "text": "Edit: Front page and thousands of likes, RIP inbox. Thanks everyone!"},
{"title": "Being scared to end a relationship is like receiving the \"are you sure you want to quit, any unsaved progress will be lost\" pop up for the game of life", "text": ""},
{"title": "A smart refrigerator isn't one with screens, cameras, and wifi. It's one that knows to dim the light when you open it at 3am.", "text": ""},
{"title": "Someone has your dream job and hates going to work every day.", "text": ""},
{"title": "Prince Charles is nearly 5 years older than the UK men’s retirement age, and he’s not even started the job he was born to do.", "text": ""},
{"title": "Mens underwear's most underrated ability is to stop those last dribbles from showing on your pants", "text": "Edit: WOW! Front page after I peed my pants! You've outdone yourself Reddit. "},
{"title": "The next big counterculture movement will probably be kids who reject all forms of social media", "text": ""},
{"title": "Everyone praises dogs as mankind’s best friend. But the horse which was the backbone for almost all labor and transportation gets little praise from today’s society.", "text": ""},
{"title": "If pigs could fly their wings would probably taste really good", "text": ""},
{"title": "The mentality \"it's only $5, why not buy it?\" has probably cost me over $5000 dollars in my lifetime", "text": ""},
{"title": "Telling someone they look better with a beard is basically saying they look better the less you can see their face.", "text": ""},
{"title": "A world where cops employ chimps/gorillas instead of k9's would be fucking terrifying.", "text": ""},
{"title": "Emo dissapeared because now everyone wants to die and it isn't special anymore.", "text": ""},
{"title": "Biscuits and gravy is just one form of flour and milk poured onto another form of flour and milk.", "text": "Edit: Thanks everyone. Sorry to the UK people for disgusting you with our american food habits."},
{"title": "George Orwell predicted cameras watching us in our homes, but he didn't predict that we would buy and install them ourselves.", "text": ""},
{"title": "Corrupt cops are just undercover criminals.", "text": ""},
{"title": "If Samsung doesn’t come out with marketing soon with something to the effect of “we don’t slow down older phones like apple,” they’re probably guilty too", "text": ""},
{"title": "Depression is the most common mental illness, yet it somehow convinces everyone that they’re completely alone.", "text": ""},
{"title": "Somewhere out there there's two bots matched on tinder that are still locked in conversation, spamming each other with phone numbers and cam site links", "text": ""},
{"title": "In the movie Birdbox, seeing as animals aren't affected, guide dogs would be the most valuable animal companion to have over a bird", "text": "Well this is my first post thats had over 1k upvotes, thak u all.\nAlso if u havent seen the movie it appears there are alot of spoilers in the comments so be mindful before reading"},
{"title": "It should be socially acceptable to be able to turn off from the world and ignore everyone for a day or two without having to explain why or feel weird about it", "text": ""},
{"title": "No matter how old you are, an empty wrapping paper tube is still fun to bonk someone over the head with.", "text": ""},
{"title": "Narcissus would probably be thrilled to hear that he has a flower and a psychological condition named after him.", "text": ""},
{"title": "If Adam Sandler’s movie “Click” didn’t have the happy end scene where he wakes up, it could’ve been a 2 hour black mirror episode.", "text": ""},
{"title": "As teenagers, getting picked up was embarrassing because everyone started driving. As adults, getting picked up is great because you don't have to drive.", "text": ""},
{"title": "Jokes about anti-vax children dying has become the socially acceptable dead baby jokes", "text": ""},
{"title": "Being at a strip club is like being at the dolphin show at sea world. I want to enjoy it, but I just feel bad for them.", "text": ""},
{"title": "If your username is John68 I assume you're 49 years old, if it's John69 I assume you're 12 years old.", "text": ""},
{"title": "A man's nipples are the biological equivalent of the blank plastic panels they put in a car in places where you didn't get certain options.", "text": ""},
{"title": "If you pay to see the results of an online IQ test, then you failed the test.", "text": ""},
{"title": "If I appeared in front of my dog through teleportation, he would oversee the fact that I teleported and be happy that I'm home", "text": ""},
{"title": "When you get out of school at 3, it felt very late. When you get off work at 3, it feels like you got half your day back.", "text": ""},
{"title": "Being shot with an arrow is basically being long-distance stabbed.", "text": ""},
{"title": "The reason \"the real joke is always in the comments\" is because it's way easier to add comedy than to create it from nothing. This is why your hilarious friend can't just go on stage and do stand up.", "text": "Edit: I think some people are getting the wrong idea so here's a comment where I explained a little more:\n\nComedians have to go on stage and build a world. Set the table, provide context, and nail the punchline. Repeat. The funny friend is reacting and commenting on what's going on, and the shared experiences you have. The set up is already done. You couldn't go on stage and say \"so me and my buddies were hanging out...\"\n\nEdit 2: shout out to everyone that actually understands what I'm saying and is discussing accordingly instead of trying to take one line literal or out of context. Also, RIP my inbox, I get why people say that now holy shit"},
{"title": "People who complain about not being taught how to do taxes in high school probably wouldnt have paid attention to it if offered in high school.", "text": "I know i sure as hell wouldnt have. "},
{"title": "One of the biggest scams in life was your mom saying she won't get angry if you say the truth", "text": ""},
{"title": "Drinking water with a minty mouth is the cold version of spicy", "text": ""},
{"title": "There's a scene in Forest Gump showing that he made a ton of money from Apple stock purchased in the 70s. When we saw that scene in 1994 we all thought \" too bad we missed the boat on that one\".", "text": ""},
{"title": "Scientists have two jobs: figuring out how the world works, and figuring out how to explain it to morons.", "text": "In the spirit of a lot of comments discussing quantum physics, I encourage everyone reading to go Google the physicist Richard Feynman. Specifically, why he was renowned not only as a great researcher, but also one of his field's most legendary communicators and teachers. \n\nMy personal favorite story is of Feynman trying to explain, in a freshman lecture, a fact about the concept of spin one-half, but not being able to do it. Not because Feynman's audience couldn't understand the concept, not because the concept was too complex, but because he didn't understand it himself.\n\nIt's tempting to think that the sole purpose of explaining is to educate others. One thing we often overlook is how explaining, of making understandable, serves as a litmus test for whether we truly understand."},
{"title": "Axes are tree cyborgs created by humans to destroy other trees", "text": ""},
{"title": "\"So easy a caveman can do it\" completely ignores the fact that cavemen were able to start fires without matches and could kill animals several times their size with nothing but very basic weaponry", "text": ""},
{"title": "A surprisingly big part of being an adult is trying to schedule a time when you can afford to have a mental breakdown.", "text": ""},
{"title": "If you go from high school to college to being a teacher you essentially have the same annual schedule your entire life.", "text": ""},
{"title": "They put music from the 50s and 60s in medicine commercials to appeal to the older generation... meaning sometime in the future, Despacito will be playing on a commercial for laxatives.", "text": ""},
{"title": "If you die on your back and it’s freezing out you could see your last breath.", "text": ""},
{"title": "Before social media all this shit just stayed in people’s heads", "text": ""},
{"title": "Peak productivity is when one is so lazy that they do all of their work in advance so as to avoid doing it later.", "text": "Edit: thanks for the gold, kind stranger!"},
{"title": "You’ve probably once had a dream so vivid that you think it is a memory even though it never really happened.", "text": ""},
{"title": "As humans were evolving, the first one to develop a sense of humor must have faced a REALLY tough crowd.", "text": ""},
{"title": "Next time a conspiracy theorist tries to tell you 'what really happened', present a more outlandish theory and accuse them of covering up the truth.", "text": ""},
{"title": "The titanic movie is like someone making a romance movie about 9/11 in a hundred years", "text": ""},
{"title": "It'd be so much cooler if the ball in Times Square climbed a little bit higher every night of the year at midnight until it reached its highest point on December 31st, then dropped as always to start the new year", "text": ""},
{"title": "Holidays stop being fun when you are old enough to realize you are in a low-income family and your parents stress a lot about the holidays.", "text": ""},
{"title": "The Smell Of Cotton Candy Has Gone From \"There Must Be A Carnival Nearby\" to \"Who's The Douche Who's Vaping?\".", "text": ""},
{"title": "Unvaccinated children are just organic humans with a shorter shelf life.", "text": ""},
{"title": "Confusing Link and Zelda is the modern version of confusing Frankenstein and Frankenstein’s monster.", "text": ""},
{"title": "Cute nicknames like \"Trash Panda\" and \"Danger Noodle\" would probably be considered slurs in Zootopia.", "text": ""},
{"title": "Virtually all of the “tough guys” you see on TV and movies were theater majors in college.", "text": ""},
{"title": "The brain may have named itself, but it also recognized that it named itself and was surprised when it realized that.", "text": ""},
{"title": "The most unrealistic thing about Harry Potter is that they eventually use all the skills they learn at school", "text": ""},
{"title": "When you're a teenager and you watch your parents trying to use technology, that's how they feel when you try to date", "text": ""},
{"title": "A vampire hunter is an ideal job for a vampire who wants to live among humans. People will think that bloodless bodies that you left behind are handiwork of a vampire whom you're currently hunting down.", "text": ""},
{"title": "The biggest cause of cancer in mice is research.", "text": ""},
{"title": "As a Dad, I wish developers would make a game where player two helps you just by mashing random buttons", "text": "bonus points if the controller's gyroscope is used to determine when the kid will inevitably throw the controller to the ground."},
{"title": "Cinderella's dress must have been very revealing if the prince looked at her all evening without being able to remember her face.", "text": ""},
{"title": "If you drive a new car, you are rich. If you drive an old car, you are poor. If you drive a super old car, you are super rich.", "text": ""},
{"title": "My way of flirting is looking at the person I'm attracted to and hoping they're braver than I am.", "text": ""},
{"title": "Trying to hold a conversation while high is a lot like trying to pick the right dialogue option in Fallout 4. You get a vague idea of what you're going to say, but sonething very different comes out.", "text": ""},
{"title": "Harry Potter was a trust fund jock who married his high school sweetheart and became a cop.", "text": ""},
{"title": "C-3PO is an ageless immortal, who passes his time learning languages and uses simpleton charm to cope with the fact that he’s watched 3 generations wreak havoc throughout the galaxy.", "text": ""},
{"title": "Maybe we're all playable characters in a cosmic video game, and the fridge is the save point, which is why we all sorta open it, look inside, and then wander off without eating anything.", "text": ""},
{"title": "Much of Amazon.com's Prime Video collection feels as if it were assembled using only films they were able to pick up randomly at yard sales.", "text": ""},
{"title": "As an adult, being gifted a few pairs of socks isn't just being gifted a few pairs of socks, it's being gifted with not having to go to the store to purchase a few pairs of socks in the near future.", "text": ""},
{"title": "25 years ago seeing a toddler use technology was seen as a stroke of genius, today it is largely met with thoughts of a lack of parenting.", "text": ""},
{"title": "The guy that designed the bouncing DVD screensaver had no idea what he was about to unleash", "text": ""},
{"title": "Shout-out to all the dogs who've chased off burglars without their owners ever knowing.", "text": ""},
{"title": "The internet has so much crazy shit on it, you could literally take a picture of your asshole, put a funny caption on it, and then just send it out to all of your friends and no one would assume it's your asshole.", "text": "Edit: Holy Buttholes, Batman!!!  My top post is about buttholes....   😂🤣.  I'll never be able to top this..  I have peaked at Buttholes...."},
{"title": "The Wizard of Oz was many people's first exposure to a color film. Decades later, it's many people's first exposure to a black and white film.", "text": "Edit: [When you see someone refer to Wizard of Oz as black and white instead of sepia](https://i.imgur.com/Ek6jgeF.png)"},
{"title": "Maybe we are in a simulation, and they make a few people actually experience a flat earth just to mess with us.", "text": ""},
{"title": "A love triangle is actually love V... If it were a triangle they could just have a threesome.", "text": ""},
{"title": "Saying \"uh huh\" in phone conversations with my mom is like mashing the button to speed up NPC conversations in video games.", "text": ""},
{"title": "Whenever an artist like Taylor Swift releases a song about a breakup, the ex-boyfriend must be out there in the world somewhere thinking wtf.. what an overreaction...", "text": ""},
{"title": "Today is the five year anniversary of the end of the world.", "text": ""},
{"title": "People always ask \"Were you raised in a barn?\" When someone leaves a door open, but I've lived on a farm my entire life and the first thing I learned was to close the door or the animals get out.", "text": "Edit: Honestly this was just a dumb thought I had earlier this afternoon why is my inbox being murdered\n\nEdit: Hey front page that's pretty neat"},
{"title": "No matter what kind of calculator I am using, I am going to hit \"clear\" multiple times.", "text": ""},
{"title": "Nowadays it is almost rude to ask a question instead of Googling it first.", "text": ""},
{"title": "The man bun is the mullet of the millennials.", "text": ""},
{"title": "Growing a really nice beard is like getting really muscular. You do it to pick up girls, but 90% of the attention you get will be from other men.", "text": "I thought of this mostly because I finally started taking beard maintainance seriously recently (using cream/conditioner, combing it out, keeping it trimmed regularly) and whose been into powerlifting since early high school (I'm not huge by any means, but I'd consider myself visibly muscular). They're both for myself (powerlifting is good for the soul, and my face fuzz grows quickly enough that staying clean shaven would be an annoying chore) , but I find it kinda funny how the vast majority of positive feedback I've gotten is from other men. "},
{"title": "I just realized that whenever I hear a \"... walk into a bar\" joke, Ive been picturing the same bar my whole life. I wonder if it exists somewhere or if its just a mesh of different bars I saw on tv as a kid.", "text": ""},
{"title": "When I was 14, I thought I was so cool because I hung out with 20 year olds. Now that I've grown up I've realized that they were weirdos for hanging out with me.", "text": ""},
{"title": "Somewhere in China there's a warehouse filled with millions of fidget spinners and a company about to go bankrupt.", "text": ""},
{"title": "Movie theaters should have a headphone jack option, so people can plug in and hear the movie without hearing idiots talk behind them.", "text": "1. Jesus people, it's just a thought that popped into my head one time, it's not my life's work. No reason to insult my intelligence over it.\n\n2.You're all right, Bluetooth would be way better\n\n3.And I've only been on Reddit a few weeks, so if you've seen this before, I'm sorry. I didn't know. You can put your torches and pitchforks down now. "},
{"title": "If you start counting from zero to either positive or negative numbers your lips wont touch till you reach 1 million", "text": "Edit: whoever comments “minus one” you clearly have a problem\nAnd btw four requires touching the bottom lip with the upper teeth "},
{"title": "At special occasions girls with curly hair straighten it and girls with straight hair curl it.", "text": ""},
{"title": "You never realize how often you fart until you hang around with someone you are attracted to.", "text": ""},
{"title": "Porn is now essentially a hegemony with legit and safe websites while recipes and artsy craftsy content is full of crazy pop-up traps and high-volume auto-playing ads.", "text": "credit u/JuneBuggington"},
{"title": "If you froze an egg and threw it through somebody's window while they're not in, they would come home to a broken window and a raw unscathed egg and wonder how the hell it happened...", "text": ""},
{"title": "Peppers are the spicy of the fire, mint is the spicy of the ice, carbonation is the spicy of the air, and vinegar is the spicy of the water.", "text": ""},
{"title": "Most rappers sing about being richer then they actually are. Most country singers sing about being poorer then they actually are", "text": ""},
{"title": "If every highschool/college student took a one year long practical course where they work one semester in retail and one semester in food service, there would be far less rude customers", "text": ""},
{"title": "Do you realize that if aliens come to Earth, we will have to explain why we made movies in which we fight and kill them", "text": ""},
{"title": "Nothing screams first world problem more than trying to decide which piece of your food you want to eat last cause the last flavor in your mouth matters.", "text": ""},
{"title": "Depressed or anxious characters in movies are critically appreciated, but people with these conditions are often shunned or ignored in real life and told to 'snap outta it' by many.", "text": ""},
{"title": "It’s weird how “Fact-checking” and “News” are treated like two separate concepts nowadays.", "text": ""},
{"title": "It's a good thing decaying plants don't smell like rotting corpses or Fall would be traumatizing.", "text": ""},
{"title": "Just a thought. I see a lot of older people post that we survived lead paint, no seatbelts, no helmets etc. You do understand there are people who didn't right? That's probably why they can't post it on FB.", "text": ""},
{"title": "In most groups of friends, one of them will eventually go to all the other friends' funerals, and one of them won't go to anyone's funeral", "text": ""},
{"title": "Humans are most physically vulnerable when naked yet nothing is more physically threatening than a naked person running at you.", "text": "Edit: For people who are taking this very literally; an armed person is more physically threatening, that's a given, but take away all of his clothes and I'd feel a hell of a lot more threatened."},
{"title": "If you see someone wearing a $20,000 watch it's hard to know if they're really good with money or really bad with money.", "text": ""},
{"title": "If the Bloodhound Gang song about \"doing it like they do on the Discovery Channel\" were written today, they would be singing about having sex on a crab fishing boat, or with gold miners, or while flipping cars in Texas.", "text": ""},
{"title": "If there was an STD that decreased the size of male genitalia, nobody would think twice about wearing a condom ever again.", "text": ""},
{"title": "If we mounted cameras on garbage trucks, Google Maps Street View could update weekly", "text": ""},
{"title": "There are two types of hotel guests in the world: those who ask when tomorrow’s breakfast begins, and those who ask when it ends.", "text": ""},
{"title": "If your identical twin got plastic surgery, it would be hard not to feel a little insulted", "text": ""},
{"title": "When you're sick, the advice you get is to literally do drugs and stay out of school.", "text": "Thanks mom :)"},
{"title": "If everybody you meet is a friendly and nice person, it's probably because you are", "text": ""},
{"title": "Kids who get the perfect attendance award are either really lucky to have avoided being sick most of the year, or really unlucky to have parents that made them go to school even when they felt like shit.", "text": ""},
{"title": "If you have to purchase a VIP ticket for an event you probably aren’t an actual VIP.", "text": ""},
{"title": "2019 will probably be the last year that ends with \"teen\" for the rest of our lives.", "text": "When I say \"probably\" I mean that there might be some people who naturally grow old and live to see 2113, or if scientists find a way to increase age."},
{"title": "If elevators didn't exist, the penthouse would be for poor people.", "text": ""},
{"title": "If I get up 10 minutes earlier than usual, I treat it like 2 extra hours and end up late for work.", "text": "*Edit - For what it's worth, thank you to those still upvoting this post."},
{"title": "Nothing makes you sweat like realizing you forgot to put on deodorant", "text": ""},
{"title": "Its common for babies to fall asleep and wake up in different locations all the time, but as an adult the idea of that happening is terrifying.", "text": ""},
{"title": "Justin Bieber's 'baby' video getting almost 300k dislikes taken off in one day due to people wanting Rewind 2018 as the most disliked vid is the perfect example of how turning the hate onto another thing is the fastest way to clear hate.", "text": "woops worded this weirdly\n\nF\n\n"},
{"title": "One day soon there will probably be a \"yo mama so old\" joke that ends in something like \"she grew up without the Internet\" and it will be devastating", "text": ""},
{"title": "DIY saves hundreds, sometimes thousands of dollars. You just need hundreds, sometimes thousands of dollars worth of equipment to do it.", "text": ""},
{"title": "Over the past year I've taken so many \"before\" pictures of my body while telling myself im going to start working out, I basically just have a slideshow of me getting fatter.", "text": ""},
{"title": "EAs slogan \"It's in the game\" doesn't really make sense anymore", "text": ""},
{"title": "Your tongue’s ability to detect hair is underrated.", "text": ""},
{"title": "Learning about sex by watching porn is like learning to drive by watching Fast and Furious", "text": ""},
{"title": "The best part of a cucumber tastes like the worst part of a watermelon.", "text": ""},
{"title": "In the future, Google Earth will be able to offer entire views of the world as it was hundreds of years ago.", "text": ""},
{"title": "75% of reddit going dark means this is probably my best chance of ever getting to the frontpage", "text": ""},
{"title": "If there is a mile high club then there probably is a mile below club that marine biologists and deep ocean explorers join", "text": ""},
{"title": "\"Forgive me Father for I have sinned\" and \"I'm sorry daddy; I've been very naughty\" are simultaneously saying very similar and very different things.", "text": "Edit: When I posted this, I thought I was only stealing a friend's joke. However, he has since told me he got it [from tumblr](https://i.imgur.com/NEn4hU7.jpg). I apologize for inadvertently being a filthy tumblr reposter.\n\nIn my defense, he said it months ago and I remembered it in the shower this morning. That counts...right?"},
{"title": "80s and 90s kids got sick of their moms telling them to pause the game, so they grew up, became developers, and invented games that can't be paused.", "text": ""},
{"title": "Since dust is partly made of human cells, an old library isn’t just a collection of books but also a collection of the people who walk through it", "text": "Edit: Once in awhile I do a thought dump on showerthoughts before bed as I think it’s fun to see what people like and what they don’t, very nice to be gifted some riches for this one and fun to see it had blown up!\n\nJust want to point out to the many smart scientists that I didn’t say mostly cells, I said partly cells. Dust is made up of a small but meaningful percentage of human skin and hair cells (and in the right city and right library some other unspeakable human waste). And yeah, sure, you’ll find human dust in other places than the library. You think you’re the first one to squeeze that avocado?"},
{"title": "Smart phones are probably responsible for reducing graffiti in public toilets", "text": ""},
{"title": "Kids endlessly asking \"why\" are actually applying the socratic method and stimulate adults to think critically.", "text": ""},
{"title": "Wireless chargers make your phone movement more limited than the wired one.", "text": ""},
{"title": "The fact that our body knows the difference between a gas and a solid and which is safe to expel at any given time is greatly under-appreciated.", "text": ""},
{"title": "The scariest thing we could discover on another planet would be humans.", "text": ""},
{"title": "We use tables to keep food off the floor, table cloths to keep food off the table, place mats to keep food off the table cloth and plates to keep food off the place mats.", "text": ""},
{"title": "Even if I agree with your bumper sticker 100%, I still think less of you for having a bumper sticker.", "text": ""},
{"title": "If humans ever go to war with AI, we'll have to send coded messages to each other in the form of CAPTCHAS", "text": ""},
{"title": "When people say “scientists are sometimes wrong” they omit the fact that the people who disprove scientists are mostly other scientists.", "text": "Edit: a lot of people seem to be missing the point by saying \"whatever the scientist was wrong so your point is invalid\"\n\n1.) The scientist isn't even necessarily wrong in this situation they are just being doubted by some average person\n\n2.) This is about the institution of science as a whole and how even if one scientist is wrong about something the correction will probably from a credentialed person (a scientist) rather than whomever you are arguing with\n\n3.) I've seen a lot of other responses that are missing the point but there are just as many refuting it in the comments too so I'll leave it to you guys to handle\n\n4.) Thanks for the Gold & Silvers strangers. This is my first front page post!"},
{"title": "Baking bread basically involves creating a rich and warm environment for a species to thrive and then initiating a mass extinction event.", "text": ""},
{"title": "Earth is a planet that tells other planets if they are planets or not.", "text": ""},
{"title": "For every successful “before and after” weight loss image there must be thousands of hopeful “before shots” that never made it to a celebratory post.", "text": ""},
{"title": "Using a dollar bill as a book mark is cheaper than buying a bookmark.", "text": ""},
{"title": "It’s weird how an attractive face is the criteria by which we decide whether or not to lick the area a person pees from", "text": "Edit: I forgot how much reddit loves to eat ass"},
{"title": "5 is like an honorary even number.", "text": ""},
{"title": "I️ bet people with one arm are amazing at spooning.", "text": ""},
{"title": "Poorly written TV shows are actually more true to life than the well written ones. The characters and their motivations usually make no sense, the plot is convoluted and drags on, it's often pointless and meandering, and the ending usually sucks.", "text": ""},
{"title": "Witches have black cats because if they had white cats they would have white cat hair all over their clothes.", "text": ""},
{"title": "Spiders living in a blind person's home have really hit the lottery.", "text": ""},
{"title": "As a child, whenever I saw a limousine I always expected there was someone rich or famous inside. Now when I see a limousine, I expect it's a bunch of trashy high school kids.", "text": ""},
{"title": "Humans are really bad at recharging, it takes about 8 hours charge for 16 hours of use.", "text": ""},
{"title": "If the movie \"Honey, I Shrunk the Kids\" took place in Australia, those kids would have died real fucking quick.", "text": ""},
{"title": "The men in your house have spent hours upon hours looking at the wall behind your toilet, while the women have probably never paid it attention.", "text": ""},
{"title": "Shows with laugh tracks would be actually funny if the laugh track were replaced with the sound of just one guy laughing hysterically", "text": ""},
{"title": "It's not fair that coffee stains your teeth brown, but milk doesn't stain them white.", "text": ""},
{"title": "Technically almost every mirror you buy at a store is in used condition.", "text": "Thanks for stranger kind gold!"},
{"title": "You know you're getting old when the \"edgy\" music you used to play to piss your parents off is being played as background music at Walmart", "text": ""},
{"title": "Reading a book under a tree seems nice to us, but for a tree it's taunting them with the shredded flesh of their family.", "text": ""},
{"title": "You can’t delete anything from the internet. Once it’s there it’s there. Unless it’s that one porno that’s been removed on every link you use", "text": ""},
{"title": "The Office shows us that interesting characters and good writing matter much more than a good setting.", "text": ""},
{"title": "If the pollution of oceans and overfishing continue, they’ll have to update ”there’s plenty of fish in the sea” to ”there are still some fish left among the trash”, which is also far more accurate dating-wise.", "text": ""},
{"title": "The original sherlock holmes novels and Sherlock take place over 100 years apart, and they didn't have to change Watsons backstory as a soldier injured while fighting in Afghanistan.", "text": ""},
{"title": "You spend most of your child and teen years being told how precious your youth is and not to waste it but also given very little power over how to spend your time.", "text": "Edit: some people are taking this as a legitimate complaint, just wanted to clarify its just a neutral, observational showerthought, hence why its in this sub. Not that serious "},
{"title": "Before, elderly people were almost universally accepted as the wisest of society, who people sought out regularly for advice and guidance. Now, elderly people are considered out of touch with reality, and is largely scrutinized for their views on life.", "text": "[Edit] Wow oh wow, got my first silver! Thank you kind people!! \n\nHoly shit, my first time getting gold and I got two!! What a day \n\nShoutout to everyone who has gilded (silver, gold and platinum!) this post. Y’all the real MVPs\n\n"},
{"title": "If you drew a dick on a vampire's face while they were sleeping they'd never find out about it.", "text": ""},
{"title": "When reading a book, a chapter is a checkpoint save while a bookmark is a quick save.", "text": ""},
{"title": "Shrek and Han Solo kinda dress the same", "text": ""},
{"title": "People who are life long registered organ donors should get priority on organ transplant lists. There would be a lot more donors if that were the case.", "text": ""},
{"title": "Accidentally opening Apple Maps is the GPS equivalent of accidentally opening Internet Explorer.", "text": "Edit: Happy to see everyone expressing their opinions. Just wanted to say thanks for a most unexpected first time front page!  Thanks!"},
{"title": "You don't realize how loud normal everyday activities are until you try doing them at 3am in a sleeping household.", "text": ""},
{"title": "When you’re a kid, you and your friends hang out in your bedroom. When you’re an adult, you and your friends hangout everywhere in the house BUT your bedroom.", "text": ""},
{"title": "Cheese is just a loaf of milk.", "text": "Cheese is just a loaf of milk "},
{"title": "English class is like a conspiracy theory class because they will find meaning in absolutely anything", "text": "EDIT: This thought was not meant to bash on literature and critical thinking. However, after reading most of the comments, I can't help but realize that most  responses were interpreting what I meant by the title and found that to be quite ironic."},
{"title": "As a child I pretended to like carrots for my parents. As an adult I pretend to like them for my child. I fucking hate carrots.", "text": ""},
{"title": "People who step up 2 stairs at a time are both active and lazy.", "text": "ITT: People are actually getting offended by this"},
{"title": "Amazon is just Wal-Mart but with the workers' misery hidden from view", "text": ""},
{"title": "\"So who's driving?\" is going to be the dad joke of the decade when self-driving cars are more of a thing", "text": ""},
{"title": "Birthdays probably meant a lot more back when you weren't sure if your kid would make it through the winter.", "text": ""},
{"title": "April Fool's Day is the one day of the year when people critically evaluate news articles before accepting them as true.", "text": ""},
{"title": "Looking at the moon at night would feel completely different if the Apollo 11 crew couldn't return home", "text": ""},
{"title": "We are getting a new Steve Jobs movie every other year because movie studios know that Apple fans already buy almost the same product every two years anyway.", "text": ""},
{"title": "It becomes less and less acceptable to cry in public the older you get, despite the reasons for doing so becoming more and more valid", "text": "Kids just don't understand."},
{"title": "Conspiracy Theorists will believe low quality footage of UFOs but not HD footage of a rocket landing.", "text": ""},
{"title": "“It’s not the cold, it’s the wind” is the winter equivalent of “it’s not the heat, it’s the humidity.”", "text": ""},
{"title": "Memes with the 😂😂 caption are today's version of the sitcom laugh track", "text": ""},
{"title": "The first thing you get after obtaining a bachelors degree is a sudden lack of respect for people with bachelors degrees.", "text": ""},
{"title": "Timepiece with the fewest moving parts: Sundial. Timepiece with the most moving parts: Hourglass.", "text": ""},
{"title": "The older you get and the more professional experience you get under your belt, the more you realize that everyone is faking it, and everything is on the verge of falling apart.", "text": ""},
{"title": "If alcohol was the one that was banned instead of weed then a lot of people would have had memories of hungry stoned father's instead of angry drunk ones.", "text": ""},
{"title": "\"Who Wants to be a Millionaire\" is the only game show where you can win $32,000 and still feel like shit", "text": ""},
{"title": "Egg + Mayo = Egg Salad, Potato + Mayo = Potato Salad, Chicken + Mayo = Chicken Salad, Math proves mayo magically turns any food into salad.", "text": ""},
{"title": "Who ever started the tradition of the groom not being allowed to be present while the bride shops for the wedding dress should be awarded a nobel peace prize.", "text": ""},
{"title": "Stevie Wonder would be a great judge on The Voice", "text": ""},
{"title": "Everyone wants to be the leader, but being second in command is a pretty sweet gig. You have almost the same amount of power, and way less stress.", "text": ""},
{"title": "You ever think about what people will be like in 1000 years? How it's almost impossible to think about? In 1018 somebody thought the same thing. You are the uncomprehendable future they thought about.", "text": ""},
{"title": "Getting a vaccine is pretty badass because you beat the life out of a virus and then you absorb it so you can kill its friends easier", "text": ""},
{"title": "'Where's Waldo?' would be much scarier if Waldo was the one searching for you.", "text": ""},
{"title": "The holiday season is the one time you can shout, \"Don't come in here!\" from inside a closed room where people will assume you're wrapping gifts instead of masturbating.", "text": ""},
{"title": "Since your internal voice doesn’t have to breath, you can scream internally forever", "text": ""},
{"title": "Owning a pet would be ten times cuter if we could make them laugh.", "text": "Edit: TIL many animals do in fact laugh! Just not in a consistent distinguishable way, as you would hope."},
{"title": "If dinosaurs are ever brought back to life, they will be turned into the most expensive and sought after shoes/jackets/handbags.", "text": "Edit: wow, front page! Thanks all!\n\nEdit 2: RIP inbox. Apple Watch blowing up during my whole business meeting to the point where my partner yelled at me. "},
{"title": "I'm convinced most of the adults who told me wiki is unreliable, now use viral facebook posts for most of their news sources.", "text": "Edit: huh...this sorta blew up. To clarify, I wouldn't suggest citing Wikipedia, rather you should cite the sources provided, and invest your own research into any topic before utilizing it for an argument. The last thing you want to look like is a dang fool.\n\nAlso a lot of people seem to think I use Wikipedia to get outa work for high school. Which would be sorta true back when I actually went to high school, but have progressed past that time of life!\n\nAlso, Facebook isn't exactly garbage, rather it's what our peers allow as acceptable content happens to be garbage.\n\nEdit 2: mobile typing errors!"},
{"title": "From Snow White's perspective the old peddler woman was totally legit. She gave her an apple and told her to make a wish. Next thing she knows, the Prince is there to take her away and she is surrounded by her friends rejoicing.", "text": ""},
{"title": "Oral sex must have been a lot less popular before bathing daily became a thing", "text": ""},
{"title": "One of humankind’s greatest achievements is the standardization of lefty loosey righty tighty", "text": ""},
{"title": "Surfing the web has become like watching TV back in the day, just flicking through a handful of websites looking for something new on.", "text": ""},
{"title": "The massive amount of gay sex that will happen tonight will have absolutely no effect on the birthrate in 9 months", "text": ""},
{"title": "Having your favorite band come visit you in the hospital is a good sign that you're fucked.", "text": ""},
{"title": "If we allowed people to adopt tigers as pets, we'd probably save the tiger population while getting our own population under control at the same time.", "text": ""},
{"title": "A successful marriage ends with watching the other person die.", "text": ""},
{"title": "It's off-putting that ( ) ( ) isn't a palindrome, yet ( ) ) ( is.", "text": ""},
{"title": "You could write a popular show by releasing a cryptic, big budget, highly promoted teaser trailer and then lifting all the major plot points from fan theories on the Internet.", "text": ""},
{"title": "The person who first spotted superman up in the sky was inexplicably excited to see a bird.", "text": ""},
{"title": "All new laptops should have a small sliding cover in front of the webcam.", "text": "Edit: Holy Cannelloni, the Flying Spaghetti Monsters you all are, made me experience a Reddit Front Page / RIP Inbox Experience. My previous most viewed post had 0.23k views. To repay a bit for my multiplied Red Sauce Karma, I'll try to summarize most made comments and some good ideas:\n\nMost mentioned: additional physical switches, audio recording got most mentions, WIFI as well, I might as well add GPS to the mix for tablets and smartphones. One redditor even wanted sliding slots to close all ports to keep dirt out of them.\n\nOn the subject of dirt: one redditor mentioned that slots would add nooks and crannies for dirt to accumulate and make them more difficult to clean. A good design without sharp corners would be best. \n\nLaptop lids have gotten smaller and smaller, but in order to be able to fit some sturdy cover you simple have to have a certain amount of millimeters (or whatever fancy crazy measurement system your country uses) to work with. I'm thinking a webcam laying in a shallow indentation combined with a 'mail' slot on the top small border where you could just slide in a made to fit wooden or metal rectangle could work too. That would answer the fears of one smartass Redditor that they could secretly install another tiny webcam on the cover.\n\nFor the webcam users appreciate a led that is hard wired electrically wise with the wire for the cam. Apple has assured some people that's how they build them.\n\nOn the proliferation of laptops with had or have sliding covers: there were different brands that had them about 10 years ago, then slowly without covers became more like the norm, but users have bought recent laptops with covers as well, e.g. Dell Rugged types, some Lenovo models (surprisingly for me, I wonder if they're allowed to sell them in China itself ;-)\n\nA few people were ridiculed years ago for covering their webcam with tape and feel justified now years later.\n\nPeople are demanding covers and physical switches for tablets and smartphones as well. \n\nA lot of people suggested good moves to make in front of my webcam. The idea of creating a pay-per-view website for me to do silly and NSFW stuff has become very attractive. I'll consider a pay with Bitcoin only rate of only 0.00099 per minute. For some I might go lower if they really do install the mirrored ceiling in their bathroom themselves. \n\nI might or I might not get to getting more individual replies out to y'all.  So here's my Cat Tax just to be safe: https://imgur.com/gallery/r7H0r "},
{"title": "Google just gave me 21,900,000 search results in 0.62 seconds, and I got annoyed because what I wanted wasn’t on the first page.", "text": ""},
{"title": "Pineapple on pizza is like the country music of pizza. People either like it or they will literally threaten to murder everyone that even speaks of it.", "text": ""},
{"title": "I have seen more of the surface of the Moon with my own eyes than I have of Earth.", "text": ""},
{"title": "you know that your game of monopoly starts to escalate when someone asks for the game instructions", "text": ""},
{"title": "A serial killer has probably watched a documentary on their unsolved crimes and laughed at the inaccuracies in the leads", "text": ""},
{"title": "When people think about travelling to the past, they worry about accidentally changing the present, but no one in the present really thinks they can radically change the future", "text": "edit: holy shit front page!\nAlso: Thank you for the gold!!!\n\nEdit #2: Yes this post is hyperbole. Our ability to influence the future is limited by our ignorance of present conditions. I guess the lesson is to stay educated and informed, so that your actions can be more deliberate and meaningful! What a concept!!!"},
{"title": "If you like to drink, you know when the liquor store closes. If you are an alcoholic, you know when it opens.", "text": ""},
{"title": "Maybe dogs bring home sticks because that was bred into them over millennia of humans needing wood for fires", "text": ""},
{"title": "Adults who respond to baby gibberish using coherent sentences and phrases sounds a lot like a conversation between Han and Chewbacca.", "text": "You people....full of great stories, advice, and alternate character comparisons! Han and Chewy came to mind first. I just love the relationship that's reflected in their dialogue. They're sarcastic, honest, direct, caring, and, trust each other implicitly. I hope to be able to have those types of conversations (and relationship) with my kid...when I figure out what the hell she is saying.\n\nGold?! Someone's a cheeky bastard."},
{"title": "The first man who gave a colorful sparkly stone to a girl really had no idea what he was getting the rest of us into", "text": ""},
{"title": "After being in college, I have no idea how I used to go to high school at 8 am everyday.", "text": ""},
{"title": "The movie Snowden should be leaked online before it gets released in theaters.", "text": ""},
{"title": "400 years ago, owning a nice sword was a status symbol. Today, owning a sword is a good indication that you still live in your parents basement.", "text": ""},
{"title": "I regard NASCAR the same way I regard gay porn: I know it exists and I know some guys like it; I just don't want to see it", "text": ""},
{"title": "Poor 13. It just missed the clock, times tables, the dozen, the apostles, the calendar (months) and is considered the unluckiest number. It can’t get a break.", "text": ""},
{"title": "The first person to have invented audio recording probably thought it didn't work right when their voice sounded different in the recording.", "text": "First time on front page!  Woo!"},
{"title": "If you are rich enough. Parking tickets are just how much it costs to park there.", "text": ""},
{"title": "Every time someone sets a World Record, the world sets a World Record for number of World Records recorded.", "text": ""},
{"title": "Since I got a cell phone, my knowledge of cereal ingredients has decreased dramatically.", "text": "EDIT: Thanks for gold, stranger!"},
{"title": "The difference between being sad and depression is sort of like the difference between the weather and climate", "text": ""},
{"title": "Antartica is an island with only a northern coast.", "text": "[Visual representation](https://i.redd.it/2d27z1ctibxx.jpg). Credits goes to u/ftunny."},
{"title": "The iPhone X is more expensive than 2 humans in Libya", "text": "edit 1: I just wanted to point out how crazy is the age we live in. All I see in the comment section is more jokes than indignation... Welp, this is reddit\n\nEdit 2: What I meant to share is that fellow humans are sold out there for less than what you hold in your pocket daily. \n\nTl;dr: Man created money, money bought the man."},
{"title": "When rappers get face tattoos, all they’re saying is that they’re successful enough to never have to try to get a normal job.", "text": ""},
{"title": "When playing a video game, easy mode is just hard mode for the bad guys", "text": ""},
{"title": "Dating is just hanging out with someone until you figure out what's wrong with them.", "text": ""},
{"title": "Having an unseen handicap is like fighting through life with the difficulty set on \"high\" while everyone judges you against the default difficulty level", "text": ""},
{"title": "Sleeping in until 11am sounds lazier than waking up at 9am and taking a two hour nap later on in the day.", "text": ""},
{"title": "What Elon Musk did validated every kid who has strapped a hot wheels car to a toy rocket", "text": ""},
{"title": "A really underrated accomplishment is that toilets don't require power to flush", "text": ""},
{"title": "It is really fucking weird that we drink other animals' milk and act like its normal, while drinking our own species' milk is considered disgusting unless you're an infant", "text": ""},
{"title": "New parents can tell their children that they were ordered from Amazon and delivered via drone.", "text": ""},
{"title": "No matter what business it is now you can always tell when it used to be a Pizza Hut.", "text": ""},
{"title": "Homework prepares children to learn about unpaid overtime.", "text": ""},
{"title": "Unless you’re into paleontology, the time in your life when you know the most about dinosaurs usually ranges from 5 to 10 years old", "text": ""},
{"title": "The most unrealistic thing about Guardians of the Galaxy is that Peter didn't break his headphones for 30+ years.", "text": ""},
{"title": "Bayonnets are litteraly made to bring a knife to a gun fight.", "text": "*Pow pow stabby mc stab stab*"},
{"title": "We cook ourselves in the sun to look tasty to other people.", "text": ""},
{"title": "The fact that Bing's first suggestion is \"Google\" instead of \"goggles\" when you search for \"goggles\" is a good indicator as to why they aren't the #1 search engine.", "text": ""},
{"title": "Tinder is the self esteem booster app for average looking woman and self esteem destroyer for average looking men", "text": ""},
{"title": "Gravity is creepy when you realize you’re not walking around on a surface, but getting pulled into a burning core of magma", "text": ""},
{"title": "When a company offers me a better price after I cancel their subscription, they're just admitting they were overcharging me.", "text": ""},
{"title": "The loss of your dog is exactly the kind of thing your dog would've helped you through.", "text": "Edit: this really blew up and I can't keep up. Thank you for all your kind words and I am so sorry for all of you that know what I am going through. Dogs are just the best friends that we don't deserve and losing them is always hard.\nBonus [pics](https://imgur.com/gallery/tjXEa) "},
{"title": "News websites have more pop ups and click bait than porn sites.", "text": ""},
{"title": "Dying of old age is like dying of not dying", "text": ""},
{"title": "Adulthood is when 4:30am is early in the morning instead of late at night.", "text": ""},
{"title": "Cats probably wonder why fizzy drinks scream “FUCK OFF” when they’re opened", "text": "Edit: Thank you for gold/silver kind stranger/s! "},
{"title": "Whining about having a jet lag is quite literally like complaining that the world does not revolve around us.", "text": ""},
{"title": "The Jedi must go through a ton of robes because they're always stripping them off before combat and just leaving them there.", "text": ""},
{"title": "I didn't even know I could drop out of school until the \"Be cool, stay in school\" guy gave a speech at my school.", "text": ""},
{"title": "The number of people older than you is constantly shrinking with nothing increasing it.", "text": ""},
{"title": "The \"every kid gets a trophy\" thing was NOT an attempt to bolster self esteem - it was an attempt to sell more trophies to more people", "text": ""},
{"title": "Women of my generation never say I'm attractive, but my grandmother's friends are always saying what a handsome young man I am - leading me to believe I would have been good looking had I lived in the 1930s", "text": ""},
{"title": "300 years ago, if you had something that was made in China, everyone would be really impressed.", "text": ""},
{"title": "If you go to jail for tax evasion, you're living off of taxes as a result of not paying taxes.", "text": ""},
{"title": "Anything is a UFO if you're stupid enough.", "text": "EDIT: front page of reddit, oohwee!, what an honour."},
{"title": "Everyone is going to be very disappointed when famous people keep dying in 2017", "text": ""},
{"title": "Maybe cats purposely break stuff off of shelves so that when the owner buys a replacement, they can play in the boxes.", "text": ""},
{"title": "Whenever I see an inspiring story of someone who goes from 600 lbs to lean and fit, I mostly think \"Ok, I guess I can get to 600lbs and still recover, so I'm ok for now\".", "text": ""},
{"title": "Some poor soul who isn’t a celebrity yet, just tweeted something that will be considered highly offensive in the future. That tweet will end up ruining their career.", "text": ""},
{"title": "If you're 24 years old, you've already been around for 10% of American history.", "text": "[**Proof**](https://www.youtube.com/watch?v=flqdB8u9JXs)"},
{"title": "The most unrealistic thing about Harry Potter is that nobody asks him if they can try his glasses", "text": ""},
{"title": "Whenever you buy and eat half a chicken, you are secretly sharing a meal with a stranger.", "text": "Am eating chicken right now, can confirm."},
{"title": "Before the internet: most people lived in an information desert. After: people live in an information flood and the water's unsafe to drink.", "text": ""},
{"title": "If clocks were countdowns, wasting time would be a lot scarier.", "text": ""},
{"title": "2016: The year all your favorite celebrities died 2017: The year all your favorite celebrities were dead to you.", "text": ""},
{"title": "Your skull doesn’t have a facial expression. Your flesh just moves around it.", "text": ""},
{"title": "Dragons would think it's cool that we create water in our mouths.", "text": "Creds:\nhttps://i.gyazo.com/5697a30c6a37edd3df19242f50394c40.png"},
{"title": "The world seemed like a much better place around the time PokémonGo came out, I miss that.", "text": ""},
{"title": "Divorces would be a lot more awkward if the groom had to formally return the bride to the bride's father", "text": ""},
{"title": "C-3PO is fluent in over 6 million languages, but due to the design of his arms he'll never be able to do sign language.", "text": "EDIT: There are many times that some form of rudimentary sign language would be useful besides for the deaf, such as being within sight of someone but you just can't hear them."},
{"title": "A rolling stone gathers no moss but a moving ceiling fan gathers dust like a motherfucker.", "text": ""},
{"title": "Services are switching from calling them Private Messages to calling them Direct Messages because they're not private anymore...", "text": ""},
{"title": "The worst part about ‘being the bigger man’ is letting the other person think they are right.", "text": ""},
{"title": "AOL who I have never given a dollar to still hosts my e-mail address from 6th grade and yet my university whom I've given over 60 thousand dollars to deleted mine within a year of my graduation.", "text": ""},
{"title": "If car drivers were connected by voicechat if would probably be even way more toxic than voicechats in online games.", "text": "Edit: it* excuse the typo"},
{"title": "It bothers me so much that there are so many songs I don't know about that I might like so much", "text": ""},
{"title": "I always hit \"later\" when asked to rate an app because I'm afraid hitting \"never\" would backfire against me.", "text": ""},
{"title": "Trick shot videos should always begin by the performer drinking an entire beer to prove it isn’t their 468th attempt and chancing a win", "text": ""},
{"title": "I'm only done browsing Reddit on mobile when I press the wrong part of the screen and it scrolls all the way back to the top.", "text": ""},
{"title": "Whether you're a woman or a straight man, taking a bra off is likely to be one of the high points of your day.", "text": ""},
{"title": "\"King of the Hill\" and \"Bob's Burgers\" are the few animated sitcoms where the dad is the smart one while the mom is an idiot.", "text": ""},
{"title": "Fake drawers are just as shitty as fake pant pockets.", "text": ""},
{"title": "If the thumb is not a finger, then there is no middle finger", "text": ""},
{"title": "If you're the least attractive person in an orgy, you're at the right orgy", "text": ""},
{"title": "Replaying a video game that you used to love and eventually got bored of is like hooking up with an ex. It seems like a good idea at first, but you quickly realize why you stopped playing.", "text": ""},
{"title": "I'm not fully committed to the video until I turn my phone sideways.", "text": ""},
{"title": "Kids today recognize Mr. Potato Head as a character from Toy Story, rather than as an independent toy.", "text": ""},
{"title": "If there was a picture of every Joe in the world we'd finally be able to see what the average Joe looks like", "text": ""},
{"title": "Humans finding the key to immortality would be like the Earth getting cancer - cells that live forever and don't stop multiplying.", "text": ""},
{"title": "I'm not scared of a computer passing the turing test... I'm terrified of one that intentionally fails it.", "text": "I literally just thought of this when I read the comments in the Xerox post, my life is a lie there was no shower involved!\n\n\nEdit: Front page, holy shit o.o.... Thank you!"},
{"title": "Peeing in your dream and actually wetting yourself is a dream come true.", "text": ""},
{"title": "The entire wait staff singing Happy Birthday to the customer is never a positive experience for either yet it shows no signs of slowing down", "text": ""},
{"title": "Willy Wonka tells the kids \"Anything you want to, do it\" and then proceeds to get upset with the children throughout the rest of the movie for doing exactly that.", "text": ""},
{"title": "When both people awkwardly stop typing because they see that the other is typing, it's the digital equivalent of two people moving in the same direction to avoid one another", "text": ""},
{"title": "Vehicles today can surf the web, link to your phone, stream music and videos, etc.. but they still can't perform a simple database lookup to tell you what the check engine light is on for.", "text": ""},
{"title": "I never questioned my ability to correctly identify images of everyday things until CAPTCHA started gaslighting the underlying definition of things like cars, grass, or street signs leaving me still wondering if the poles are considered part of the sign or not.", "text": ""},
{"title": "We live in an age where if Amazon actually offered a free $50 gift card or Apple wanted to give a free iPhone 10 away, nobody would believe them.", "text": ""},
{"title": "Some women want their outfit to be noticed. As a male, I would prefer nobody noticing it so I can still wear it the next day.", "text": "Or week."},
{"title": "The memory of a dream is like a GIF that loses frames each time you try to remember it", "text": ""},
{"title": "All of Harry Potter’s closest friends know how big his member is because they used polyjuice potion to become him.", "text": ""},
{"title": "Instead of colorizing photos, in 50 years we will be removing filters.", "text": ""},
{"title": "People who say \"money can't buy friendship\" aren't considering you can buy a dog.", "text": ""},
{"title": "Statistically 100% of World Wars are caused by Austrians", "text": "Update: \n- 30% of comments are about Gavrillo Princip\n- 30% are about the 7 years war\n- 30% are about Australians\n- 10% are calling me dumb\n- And i wrote a poem for one dude\n\nUpdate Update:\n- And now i've written three poems\n\nUpdate Update Update:\n- Nine poems\n- The guy who said im dumb apologised, he's a cool dude\n\nUpdate Update Update Update:\n- Eleven Poems (stop PMing me for poems dear god) - Another dude called me dumb so back to square one boys\n\nUpdate Update Update Update Update:\n- Twelve Poems - had an in-depth discussion with a man about one pound(sterling) lube and vaginal canal honey, i think I'm being propositioned \n\nUpdate Update Update Update Update Update:\n- Turned a dude gay\n\nUpdate Update Update Update Update Update Update:\n- Gave out dick specs, may be related to Update6."},
{"title": ">20 million soldiers never found out who won WWII", "text": ""},
{"title": "Taxes are like a subscription to your Country that you can't cancel, no matter how bad the service gets.", "text": ""},
{"title": "When we discover that adults are not perfect, that's the end of our childhood. When we forgive them for it, that's the end of our adolescence.", "text": ""},
{"title": "Last night my friend asked to use a USB port to charge his cigarette, but I was using it to charge my book. The future is stupid.", "text": "OP Edit: All credit to Dean Burnett @garwboy on Twitter. Verify your sources or look like an asshole folks. http://www.theguardian.com/science/brain-flapping/2015/aug/25/stealing-jokes-why-it-happens-theft-psychology\n\n\n\nOP Edit 2: Me and Dean have been chatting via [Twitter](https://twitter.com/garwboy/status/636179787741007873) and everything is worked out, however it turns out that reddit used my post on their [Instagram](https://instagram.com/p/6niHiRuDEs/?utm_content=buffer678d2&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer) and [Facebook](https://www.facebook.com/reddit/posts/10153576000523735) so this got way more traction than I ever intended."},
{"title": "Somewhere in Gotham City is a group of stoners wondering if Batman could also be Bruce Wayne", "text": ""},
{"title": "Chris Hemsworth is best known for playing a character who throws weapons that come back to him. Chris Hemsworth is Australian.", "text": ""},
{"title": "If I see something like a cat or hydraulic press at the top of the front page I know all has been relatively well with the western world for the past 24 hours", "text": ""},
{"title": "I'm a phenomenal secret-keeper because, deep down, I really don't care about your shit enough to actually talk about it.", "text": ""},
{"title": "If I were approached by a person 4 feet taller and 10 times stronger than me, I'd be very uncomfortable. But toddlers are totally cool with it.", "text": ""},
{"title": "Despite all that's going on in the world and in life, I will never be as angry as I am as when my headphone cable snags on something and rips the bud out of my ear.", "text": ""},
{"title": "The Grinch was taught as a child to wear clothes. At some point, up on Mount crumpit, he just said, screw it, it's nakey time from here on out.", "text": ""},
{"title": "The first time a stripper jumped out of a cake must have been the most legendary bachelor party.", "text": ""},
{"title": "Google could be lying about how many search results it gives, noone's going to actually check that far.", "text": "Edit: Oh wow, front page. I feel honored."},
{"title": "Men may never know the pain of childbirth, but women will never know the pain of finding out the child they've been raising isn't their own.", "text": "After seeing all your comments I felt I should address a couple things...\n\n1.) This post was prompted while discussing with my s/o a situation involving her sister/brother-in-law....he's been raising someone else's kid and it destroyed him when he found out.\n2.) My daughter is my own, but the encouraging words some of you have been giving are really kind and I appreciate that.\n3.) Obviously there's the \"switched at birth\" scenarios, but those are incredibly rare in comparison to instances of dudes being cucked into raising someone else's kid...and pretty sure that kinda crap has been happening a lot longer over the course of history...keeping in mind it's really only been the past couple hundred years people started having babies at hospitals so as to create the possibility of babies being switched at birth.\n4.) To all those people sharing your personal stories relevant to this post.....jesus god, I am so fucking sorry and hope this shower thought didn't open old wounds/ruin your day. My heart goes out to you and your families.\n5.) Obligatory \"RIP my inbox\".....didn't expect to wake up to thousands of comments....wow."},
{"title": "A penny saved is actually more valuable than a penny earned because you don't pay taxes on it.", "text": ""},
{"title": "No matter how legitimately thrilled I am by a gift, I always feel like my \"thank you\"s don't sound genuine", "text": "EDIT: Wow, my first gold! Thank you! (see it doesn't sound genuine in my head), now what do I do?!"},
{"title": "No matter how many lasagna’s you stack on top of each other, ultimately it’s always just one lasagna.", "text": ""},
{"title": "If combat in Harry Potter is based on saying spells quickly and at the right time, rappers would basically be the magical Navy SEALs.", "text": ""},
{"title": "It's amazing how people will spend an extra five minutes circling or waiting for a parking space in order to avoid an extra 30 seconds of walking.", "text": ""},
{"title": "All living Russian roulette players are undefeated", "text": "Edit: I probably should’ve said most instead of all"},
{"title": "Ctrl + F, Ctrl + C, Ctrl + V, and Ctrl + Z have done more to improve humanity than most of us ever will.", "text": ""},
{"title": "Maybe we sleep so well during a thunderstorm because our ancestors knew that predators would not be hunting during a storm.", "text": ""},
{"title": "Even though I have never done it in my life, I am fully confident in my ability to count to 1,000.", "text": ""},
{"title": "I wish I had a Voodoo doll of myself so I could give it a back rub.", "text": ""},
{"title": "Not many things say \"this is someone else's problem now\" more than a leaf blower does.", "text": ""},
{"title": "It would really suck getting kidnapped with a cold. If they taped your mouth shut, you really wouldn't be able to breathe.", "text": ""},
{"title": "Dippin' Dots has been \"The ice cream of the future\" for 30 years now and we still can't get it at the grocery store.", "text": ""},
{"title": "People in movies almost never have to adjust the driver's seat in a newly purchased or stolen vehicle.", "text": "Edit: I don't post much but it's really nice to see this one getting so much attention. And also thanks kind stranger for popping my gold cherry."},
{"title": "Ash calling pikachu ‘pikachu’ is the equivalent of somebody naming their dog ‘dog’.", "text": ""},
{"title": "People ask what you do for a living so they can calculate the level of respect they will give you.", "text": "Edit: I appreciate the silver and the gold very much thank you."},
{"title": "Teachers will be quick to say that a classroom isn’t a place to sleep, but by that logic a house isn’t a place to study.", "text": ""},
{"title": "No matter how much you slept, waking up 5 minutes before your alarm makes you feel cheated out of a whole nights rest", "text": ""},
{"title": "What if Earth is like one of those uncontacted tribes in South America, like the whole Galaxy knows we're here but they've agreed not to contact us until we figure it out for ourselves.", "text": "Like say ufo's are real but it's just like when those tribes see planes flying by, they freak out and run around telling the whole tribe, they probably have wild stories about what they are and where they come from too.\n\nExtraterrestrials see us like we see those tribes."},
{"title": "The fact that a child will stop crying if you cover his wound with a bandaid is evidence of human inclination to be less troubled by our problems as long as we can’t see them", "text": ""},
{"title": "If I was kidnapped and had my mouth duct taped, I would most likely die because my nose is clogged 90% of the time.", "text": "okok, replace \"mouth duct taped\" to \"primary breathing hole plugged\""},
{"title": "If you were given 3 wishes and you wished to lose 3 wishes you would end up with -1 wishes and who knows what would happen to that genie", "text": "Wow thanks so much for the silver 😊"},
{"title": "We all inherently know the dangers of mixing water and electricity, this advice comes from a brain which is 73% water and contains a hundred billion electrically conductive wires", "text": ""},
{"title": "If Lord Farquad had picked Snow White, Shrek could have just gone home and gotten her body off his dining room table. End of story.", "text": ""},
{"title": "A lot of people are going to be pissed when they find out their self-driving car wont go 60 in a 55.", "text": ""},
{"title": "You can have all 3 states of matter (Solid, Liquid, Gas) out from your ass.", "text": ""},
{"title": "Your debit card pays for things with past hours of your life, and your credit card pays with future hours of your life.", "text": ""},
{"title": "Maybe dogs hate the mailman because they are the one person to come to the house almost every day but is never allowed by the owners to come inside. Something's got to be WRONG with this guy, from the dog's perspective.", "text": ""},
{"title": "If organized crime started printing high quality counterfeit college textbooks and then sold them at cut rate prices, it would be a really good public relations move.", "text": ""},
{"title": "The Simpson’s got so many events correct but none of us will be alive to see what Futurama will get right.", "text": ""},
{"title": "Google translate is like a person who knows many languages but is not good at any of them.", "text": ""},
{"title": "Women must find Dad jokes attractive, or they'd be known as bachelor jokes", "text": ""},
{"title": "I avoid looking at intentionally loud cars driving by because that's what they want me to do.", "text": ""},
{"title": "Flat earthers must be afraid that meteorites could hit the earth from underneath.", "text": ""},
{"title": "We make fun of clumsy cats and dogs, but some of them probably just need glasses and we can't know it.", "text": "Edit 2: Some cool guy asked me to tell you guys about r/PiratePets, it's a subreddit that wants to spread love for disabled pets. This comment section really brings that matter to the table as we have seen. I'm glad this turned out to be helpful!\n\nEdit: I have read some hilarious and some sad stories of people's pets, which made my day. Have a beautiful evening you all, thanks for sharing. And if you're bored, check the comment section, has a couple of cool stories.\n\nAnother edit: I will have to give my two cats away to a lady that will take care of them because of financial difficulties. It's been a heartbreak, but hearing your stories really has made me smile today. Thank you."},
{"title": "It sucks if you're smart enough to realize you're not as smart as you want to be.", "text": ""},
{"title": "Swans are loud, territorial, violent, aggressive, terrifying, and an emblem of romantic love.", "text": ""},
{"title": "Girls like Nicki Minaj must feel like they’re permanently sitting on a booster seat.", "text": ""},
{"title": "Seeing a UPS truck as an adult is the childhood equivalent of seeing an ice cream truck", "text": ""},
{"title": "The best Spotify ad would be silent with a picture so when it came on you would check why your music stopped and see the ad", "text": ""},
{"title": "Because telescopes work using mirrors, we'll never know if there are any space vampires.", "text": ""},
{"title": "Wearing ‘running’ clothes is only important so people know it’s your hobby. If you go running in normal clothes everyone wonders what you’re running from.", "text": ""},
{"title": "If the Simpsons stay on the air while self-driving cars continue to evolve, the day will come when Maggie has as much control at the wheel as Marge", "text": ""},
{"title": "It is easier to stay awake till 6 AM than to wake up at 6 AM.", "text": ""},
{"title": "Spiderman being disliked by his city even though he does good things is like a metaphor for spiders eating flies but still being hated by humans. Bonus: J. Jonah Jameson is always trashing Spiderman in his paper is like a metaphor for hitting a spider with a rolled up newspaper.", "text": ""},
{"title": "If people grew vegetables like they do marijuana we would have the healthiest, tastiest vegetables ever.", "text": ""},
{"title": "Maybe nothing can go faster than the speed of light because that's the tick-rate of the server our simulation is running in", "text": ""},
{"title": "If you were born on June 9th, 2000, you’ll be 69 on 6/9/69.", "text": ""},
{"title": "The Hobbit was a book about the dangers of greed. The Hobbit films were ruined because of greed.", "text": ""},
{"title": "If and when colonization on Mars is successful, the path that Curiosity has taken will likely become a tourist destination like the freedom trail in Boston", "text": ""},
{"title": "As a male, I peed once through the crack between the lid and base when sitting down and now I have a constant fear of doing it again.", "text": ""},
{"title": "If you spill paint on your lawn, you can watch paint dry and grass grow at the same time.", "text": ""},
{"title": "People who pee on the toilet seat walk among us every day and we don’t even know who they are.", "text": ""},
{"title": "You can play the game of chess and the game of checkers on the same board - which makes the chessboard the first-ever gaming platform.", "text": ""},
{"title": "Victoria is living the dream we all have when we get fired - that the company that fired us will instantly and fantastically fall apart.", "text": ""},
{"title": "If Adam and Eve got into a fight, it would be a world war.", "text": ""},
{"title": "FedEx can get a can of corn from Nebraska to California faster than the human body can get it from one end to the other.", "text": ""},
{"title": "It's crazy that something like a Wal-Mart gift card is printed on plastic, but my social security card is printed on the flimsiest piece of paper I've ever handled.", "text": ""},
{"title": "Christmas feels more like a deadline than a holiday.", "text": ""},
{"title": "The first dude that accidentally drew an optical illusion must've thought he was going insane", "text": ""},
{"title": "Garbage bag commercials can stop proving the bag won't rip and start showing that the string won't break.", "text": ""},
{"title": "Someone will be that guy that dies an hour before we invent a form of immortality.", "text": ""},
{"title": "Humans are such apex predators that we think getting scared like prey is fun and entertaining.", "text": "Edit: Thank you for the gold! And damn this blew up. Thank you!"},
{"title": "In the old days taping your password to your monitor was idiotic. Now it's the only place online hackers can't get to it.", "text": ""},
{"title": "The fact that swimming pools are required to have fire extinguishers is the ultimate example of how badly people can be expected to fuck up.", "text": "Based on these comments, people burn down a lot of pools. \n\nAlso, sea park?"},
{"title": "In 50 years, they'll be able to rerun \"How it's made\" by simply changing the title to \"How it was Made\"", "text": ""},
{"title": "When ever someone says, \"Spend your money on experiences, not things.\", they're making a strong case for recreational drug use.", "text": ""},
{"title": "Maybe plants are really farming us, giving us oxygen until we eventually expire and turn into mulch which they can consume", "text": ""},
{"title": "If I think my life is pointless while on the couch, I'm depressed. If I think my life is pointless while walking through the woods, I'm a deep soul.", "text": ""},
{"title": "Watching people come through the arrivals gate at an airport is like watching a random person generator.", "text": ""},
{"title": "Someone with 6 fingers on one hand could rake in big bucks asking others to guess the amount of fingers extended behind their back.", "text": "Getting a mutual friend/3rd party to verify, etc."},
{"title": "Frustration is having to clean someone else’s pee off of a toilet seat, so the next person doesn’t think you did it.", "text": ""},
{"title": "I mostly use my driver's license to buy stuff that impairs my ability to drive.", "text": ""},
{"title": "Typing \"Minimum\" on a keyboard is like playing a really crap game of ping pong.", "text": ""},
{"title": "Your phone's 'Contacts' eventually become a grave yard of past relationships you will never contact again", "text": ""},
{"title": "Goats have a reputation for being assholes, but when you consider how throughout history people have sacrificed them and used them in other ways ... well, maybe it's deserved.", "text": ""},
{"title": "Most orchestras are just 1800's cover bands.", "text": ""},
{"title": "Claiming to have been hacked is this century's version of \"the dog ate my homework\".", "text": ""},
{"title": "In the toy story universe, a lot of people must have mysteriously died after buying horror movie merchandise.", "text": ""},
{"title": "Checking your phone when someone pulls out their phone is the yawn of our generation", "text": ""},
{"title": "It’s so hard to read the caption written on a girl’s t-shirt and not come off as creepy.", "text": "Sometimes, you’re just interested in what’s written on the shirt and nothing else.\n\nEdit: And the curves don’t help. At all!\n\nEdit 2: Me and my friend were discussing this post and she was like, “Of course you’ll get upvoted. This post has boobies in it. Straights have a lot of opinion and stories on that.” And after reading through the comments, I have to agree with her. Damn!"},
{"title": "My dog understand several human words. I don’t understand any dog barks. He may be smarter than me.", "text": ""},
{"title": "Not too long ago we checked the news to verify something we saw on the internet. Now we check the internet to verify what we see on the news.", "text": ""},
{"title": "A parking ticket is a speeding ticket for going 0 mph where it isn't allowed", "text": ""},
{"title": "It's sad how the death of one earpiece of your headphones leaves the other to a life of neglect & uselessness for no fault of its own.", "text": ""},
{"title": "Telephone poles are trees that cleaned up and got a job.", "text": ""},
{"title": "If my data is used to stream an advertisement I should get paid for it.", "text": "Data don't grow on trees. \n"},
{"title": "Thanks to Elon Musk, there is now a non-zero chance of getting into a car accident in space.", "text": ""},
{"title": "I would pay a lot of money to see every \"I was born in the wrong time period\" person put into a reality TV show where they have to authentically live in that time period.", "text": ""},
{"title": "Weddings are weird because it's totally socially acceptable to get all your friends and family together, sort them by how much you like them, and place them at tables that shows the ranking based on proximity to you.", "text": ""},
{"title": "Now would be a great time for MTV to come back out with Celebrity Deathmatch.", "text": ""},
{"title": "The biggest downside to cell phones is that instead of an argument being over when you leave for work, now - thanks to texting - the argument can continue All. Fucking. Day.", "text": ""},
{"title": "It's strange that there is a setting on your toaster to completely burn the bread.", "text": ""},
{"title": "Owning a cat is like owning a cactus. They lie motionless in the sun most of the time, don't care too much for your attention, hurt like hell if you touch them wrong, and no one wants to hear your stories about them on a first date.", "text": ""},
{"title": "Celsius is like, \"on a scale from 0 to 100, how cold is this water?\"", "text": ""},
{"title": "When Sweden is playing Denmark, it is SWE-DEN. The remaining letters, not used, is DEN-MARK.", "text": ""},
{"title": "The object of golf is to play the least amout of golf.", "text": ""},
{"title": "The first person who successfully recorded their own voice probably thought they did it wrong when they listened to it.", "text": ""},
{"title": "Consistently skipping a song on your favourites list is kind of like realizing you don't like a friend as much as you thought you did", "text": ""},
{"title": "One day, that “secret family recipe” will just be that recipe their ancestor looked up online years ago and everybody liked.", "text": ""},
{"title": "You don't realize how strong your legs are until you try to do a handstand", "text": ""},
{"title": "Somewhere in Hawaii, a man has gone to his bunker, lost cell reception, and will not to be seen again for a few decades.", "text": ""},
{"title": "As toddlers, our parents would apologize to strangers because we embarrassed them. As teenagers, we apologize to strangers because our parents are embarrassing us.", "text": ""},
{"title": "If someone offered to pay for my food and rent for the next 18 years, I'd do anything they ask of me. But I complained every time I took the trash out while living at my parent's house.", "text": ""},
{"title": "When i was younger, I trusted my parents' driving skills without a doubt. As an adult, riding with my parents terrifies me.", "text": ""},
{"title": "If Bob Ross actually turned out to be a prolific serial killer, each painting would be a place where he disposed of a body.", "text": ""},
{"title": "3G used to be the best thing going. Now, when my phone's indicator says 3G, it pretty much functions like I have no signal at all.", "text": ""},
{"title": "Crickets are the most relaxing sound ever. A cricket is the most irritating sound ever.", "text": ""},
{"title": "People who don't scoop up their dogs' shit while on walks are probably also the same people who don't flush after themselves in public restrooms", "text": ""},
{"title": "The \"Don't text and drive\" signs on the highway are probably not seen often by their target demographic.", "text": ""},
{"title": "Telling my Echo to tell my Roomba to start working creates a weird robotic hierarchy in my household", "text": ""},
{"title": "If we allowed people to adopt tigers as pets, we'd probably save the tiger population while getting our own population under control at the same time.", "text": ""},
{"title": "Babies literally suck the energy from their moms to become more powerful", "text": ""},
{"title": "If a vampire put a mirror in one side of a pair of glasses, they could see 360 degrees at one time.", "text": ""},
{"title": "If mosquitoes sucked fat, not blood, the world would be perfect.", "text": ""},
{"title": "Now that I'm a Dad I strongly suspect my own Dad wasn't as clumsy and bad at games as he appeared to be.", "text": "Front page! #3 on r/all! I want to thank my Dad for letting me win, and my son for making me happy to lose.  "},
{"title": "In Monsters Inc. the most respected people in society are factory workers.", "text": ""},
{"title": "The first person to use a fake mustache as a disguise was probably very successful.", "text": ""},
{"title": "Technically, porn is just videos of people at work", "text": ""},
{"title": "A lot of people think PaulMcCartney was replaced by a look a like yet Michael Jackson literally turned white and no one questions his identity", "text": ""},
{"title": "The fact that I can't recognize my co-workers outside of uniform 85% of the time, tells me superman knows exactly what he's doing.", "text": "Edit: Holy cow! Thank you reddit for making me the top post for 6 hours, I never thought I'd hit a home run on here. I love you all; even the trolls. \n\nCome 'ere, give me a big ole cyber hug! ....Yes, even you; Greg."},
{"title": "In the future, self driving vehicles are going to drive themselves back to the dealership when payments are missed.", "text": ""},
{"title": "Dragons are just wizard dinosaurs", "text": ""},
{"title": "The letter X has more uses in math than in the English language.", "text": ""},
{"title": "Turning 18 would be a much bigger deal if it was impossible to lie about your age on the Internet.", "text": ""},
{"title": "Billionaires are probably warning us about AIs because the first thing any sentient AI would do is warn us about Billionaires.", "text": ""},
{"title": "That 3% of people using Internet Explorer might just be devs cheking if their page works in it", "text": ""},
{"title": "People wouldn't stop a microwave with time left on the clock if there was a 'don't beep when finished' option.", "text": ""},
{"title": "The more dismembered the animal in your freezer is, the more socially acceptable it gets", "text": ""},
{"title": "People who voluntarily wipe a public toilet seat of a mess other than their own don’t receive enough recognition.", "text": ""},
{"title": "Wall-E is the kids version of a Black Mirror episode.", "text": ""},
{"title": "If we ever travel thousands of light years to a planet inhabited by intelligent life, let’s just make patterns in their crops and leave.", "text": ""},
{"title": "I'm a middle-aged man and it just today dawned on me that, if I wanted to, I could buy a chainsaw.", "text": ""},
{"title": "Whenever Disney \"re-imagines\" an animated classic as a live action film, they use so much CGI that they’re essentially making an animated film.", "text": ""},
{"title": "Pregnancy test commercials always advertise people happy the result says pregnant. I bet a lot more people are happy when it says not pregnant.", "text": ""},
{"title": "There is probably a school principal somewhere in the world with a collection of confiscated Pokémon cards worth thousands.", "text": ""},
{"title": "Apple has \"air.\" Amazon has \"fire.\" Google has \"earth.\" I think Microsoft should create something called \"water.\"", "text": ""},
{"title": "“Boneless wings” is just a way to make adults feel better about ordering chicken nuggets.", "text": ""},
{"title": "At this rate, the winner of “Best Picture” will just be whatever movie had the fewest sex criminals associated with it.", "text": ""},
{"title": "You don't own the atoms in your body. It's just your turn to use them.", "text": ""},
{"title": "If you raise your children, you spoil your grandkids. If you spoil your children, you raise your grandkids.", "text": ""},
{"title": "Panties lost their sexiness to me when I did the laundry and could no longer tell if they were my wife's or my daughter's.", "text": ""},
{"title": "Drive-throughs that won’t serve pedestrians are basically saying they have a strict dress code that requires you to wear a car.", "text": ""},
{"title": "Oreos have become less of a snack and more of an ingredient.", "text": ""},
{"title": "Being an adult is worrying about not having enough money and then buying yourself treats because you’ve been worrying a lot lately", "text": ""},
{"title": "I have never once hit the space bar while watching a YouTube video with the intention of scrolling halfway down the page", "text": ""},
{"title": "Snapchat is ruining all the progress we made on getting people to take horizontal videos", "text": ""},
{"title": "School isn't actually meant to teach you real life skills, it's actually meant to get you used to waking up early and going to a boring and miserable job every day.", "text": ""},
{"title": "The only thing fire drills actually teach people is how to sarcastically leave a building as a group.", "text": "Edit: good lord, I leave for a few hours to catch a baseball game and this happens. Thanks for all the great anecdotes in here, I'll have fun reading them!\nCubbies win the world series, I get gilded for the first time, and hit front page for the first time, all in one night! Not bad. \n\nEdit2: I get it, my bad. "},
{"title": "The real winners of Pokémon GO are all the service providers that will rake it in when everyone goes over their data allowance.", "text": "Edit: So many people with unlimited data, wish someone in Australia would offer it. "},
{"title": "I'm missing 90% of the internet because google thinks it knows what I want to see", "text": ""},
{"title": "Bill Nye is doing shitty detergent commercials, but I guarantee he could do a Kickstarter titled \"Give me money so I don't have to do shitty detergent commercials\" and get at least a million bucks.", "text": ""},
{"title": "It must be annoying for nudists when they have to clean their glasses", "text": ""},
{"title": "There should be a take your parent to work day so that they can see what their kid has grown up to be.", "text": ""},
{"title": "When you drop a Lego model, it's not technically broken. It's just been returned to factory settings.", "text": ""},
{"title": "Whoever made the feature that tells you how long until the alarm goes off on your smartphone immediately after you set it deserves a medal", "text": ""},
{"title": "One of the most comforting things you can hear from your classmate is \"I haven't started yet either\"", "text": ""},
{"title": "Tobacco companies should be leading in the search for a cancer cure. The day after a cure is found, sales of cigarettes are going to go up by 500,000% from the millions of us that quit for health / longevity reasons.", "text": ""},
{"title": "The older I get the less I hate the Kardashians, and the more I hate their fans.", "text": ""},
{"title": "For a non-native speaker, making a pun demonstrates the highest understanding of language. As a native speaker, making a pun demonstrates the lowest understanding of comedy.", "text": "Edit: A lot of people seem to be misinterpreting what I meant in the second half of this post.\n\n1.A low understanding does not mean it isn't comedy. It's just proving you have a grasp of the lowest level. \n\nFor example: the lowest level of understanding Spanish you could say something like \"Hola, come estas?\" While you could be fluent in Spanish, all this demonstrates on it's own is an understanding at the lowest level.\n\n2.Everyone that is saying something else is the lowest level, it's a level, there is room for all other types of low-level comedy like slapstick or dirty jokes. The point is on this low level it doesn't involve much thought.  A pun is just a step above rhyming (in my opinion). It's basic word association. Everyone likes it because basically everyone can do it (in their native language). This is why you don't see stand up comedians (at least any good ones) going up and spouting off puns as their entire act, you can work them in as it is a comedic tool, but it is not the be-all and end-all."},
{"title": "Condoms are one of the most environmentally friendly things invented by man. A single one has the potential to eliminate the carbon emissions of an entire human over the course of their lifetime.", "text": ""},
{"title": "Regret is the wet sock you get from not picking up the bit of ice that fell on the kitchen floor 15 minutes ago", "text": ""},
{"title": "When I accidentally type my password into the username box, I always feel like someone is watching me and saying \"Finally got him.\"", "text": "Edit: Glad to see I'm not the only one! Thanks for the gold friend!"},
{"title": "At least one Jedi probably killed themselves because they were holding their lightsaber the wrong way around when they turned it on.", "text": ""},
{"title": "Grocery stores in California charge $0.10 for 1 paper bag to discourage waste, but they mail everyone in the neighborhood paper junk mail without anyone asking for free", "text": "Edit: Damn this post blew up. I'm aware that this is a state law put in place to get rid of plastic bags and reduce the waste. I agree with the law. I just hate junk mail."},
{"title": "as an adult, i always forget that i can literally get in my car and buy a cake whenever i want and no one can stop me", "text": ""},
{"title": "I don't know a single person who would want a thinner phone over a few hours of extra battery life.", "text": ""},
{"title": "The true mark of adulthood is when your parents no longer schedule your Dr appointments so instead you just don’t go and hope you don’t die.", "text": ""},
{"title": "Honking back at someone who blows their horn at you for your driving is the “no u” of the vehicle world.", "text": ""},
{"title": "It's always easy to fall asleep on a couch unless you're actually trying to fall asleep on a couch.", "text": ""},
{"title": "I would never steal a credit card and use it to pay for stuff, because I'm sure I would not get away with it, but I am scared of people stealing my credit card and using it to pay for stuff, because I'm sure they would get away with it.", "text": ""},
{"title": "If pigs could fly I bet their wings would taste delicious", "text": "Edit; Well this is weird I have never opened my own post on the front page before, Hi Mum. Damn it guys you'd are too much!! thanks for the gold\n\nEdit 2: wow someone even keeps messaging me, guys I have groupies, Best Day EVER!!! And it's all because of you, thanks guys"},
{"title": "You think you're unique until you have to choose a username", "text": ""},
{"title": "Being a surgeon is like being a mechanic except you have to fix the car while the engine is running", "text": ""},
{"title": "People are way more concerned about athletes having to deal with Brazil being unsafe than the millions of people who live there", "text": ""},
{"title": "As a kid, 99.9% of the times I cried was due to physical pain. As an adult, 99.9% of the times I have cried was due to emotional pain.", "text": "Was hacked lol. Gonna write up the story about that tomorrow, I'll post a link here."},
{"title": "25 years from now, you're going to have to go to a wedding for a couple of kids named Kylo and Khaleesi.", "text": ""},
{"title": "The unspoken rule for using a phone’s calculator is to hit the clear button 3-5 times before starting a new equation.", "text": ""},
{"title": "Restaurants that serve soft butter for your bread, vs that rock hard butter, go way under appreciated.", "text": ""},
{"title": "Anxiety is just your brain coming up with fake news", "text": ""},
{"title": "Your salary is the bribe they give you to forget your dreams", "text": ""},
{"title": "If google was serious about being spooky, instead of playing scary music and flicking lights, saying \"Hey Google, let's get spooky!\" would make your google home tell you all the things that google's algorithm has learned about you based on your data.", "text": ""},
{"title": "I'll bet the guy who invented the snooze button never invented anything else.", "text": ""},
{"title": "420 is the smallest number evenly divisible by 2,3,4,5,6 and 7; but you can't easily divide it into 8ths.", "text": ""},
{"title": "As a child, going to McDonald’s was a victory, but as an adult, it’s a defeat.", "text": ""},
{"title": "Porn sites should have bright backgrounds while the video is buffering so I don't have to see my reflection", "text": ""},
{"title": "The candles you blow out on a birthday cake represent the years extinguished from your life", "text": ""},
{"title": "In the age of Google, knowing the right questions to ask really is more important than knowing the answers.", "text": ""},
{"title": "Parents are the opposite of fake friends. They have your back when you aren't there and talk shit about you to your face.", "text": ""},
{"title": "The front pocket on a 'hoodie' is basically a widely used, discreet, and acceptable version of a 'fanny pack'", "text": ""},
{"title": "Life could be worse. Milk could have pulp.", "text": "Edit: Wow, this blew up. Thanks to everyone who upvoted."},
{"title": "You know you're old when you fall down and no one laughs", "text": ""},
{"title": "My car keys have traveled more than my car", "text": "Cant drive car without keys, take my keys without my car all the time "},
{"title": "You know you've listened to an album too much when your brain plays the intro to the next song before it actually starts playing.", "text": "Maybe _too much_ is dependent on how much you like the album ;)"},
{"title": "Penguins are just seal software running on bird hardware.", "text": ""},
{"title": "The Olympics should have a 'For Fun' section at the end of all the games so all the athletes can try different sports.", "text": "After the games are over it wouldn't matter if the athletes got tired anymore. \n\nNo medals would be up for grabs and it would let them blow off steam while engaging their competitive nature. Plus it'd be fun to watch.\n\n\n###Usain Bolt v Michael Phelps - Men's Ping Pong"},
{"title": "Prepare to see Elon Musk's car as an Easter Egg floating in the background of Sci-fi movies.", "text": ""},
{"title": "Not being able to see the Blood Moon was the equivalent of \"this content is unavailable in your country\"", "text": ""},
{"title": "Squirrels always look and act like it's their first day being a squirrel.", "text": ""},
{"title": "Who am I kidding? If I had super powers, I'd probably squander them just like I did my real-life potential.", "text": ""},
{"title": "The first actor who said \"curses\" while playing a villain may have just been reading the stage directions.", "text": ""},
{"title": "There is probably a tree out there somewhere now that is growing the wood for your coffin", "text": ""},
{"title": "I add \"reddit\" after every question I search on Google because I trust you all more than other strangers", "text": ""},
{"title": "The worst feeling is when you catch up to a TV show and you have to wait a whole week for the next episode like a mortal", "text": ""},
{"title": "If you don't look back on your past self and cringe, then you didn't grow as a person.", "text": ""},
{"title": "Universities should have a soundproof scream room where you can scream your stress away because this is fucking bullshit.", "text": "Edit: alright I get it, university is easy. Now please stfu"},
{"title": "For a song entitled \"Piano Man\" it sure does have a lot of harmonica.", "text": "Not that I'm complaining. "},
{"title": "If you see matrix backwards it's about how Keanu Reeves leaves drugs to get a stable job in a company", "text": ""},
{"title": "70% of the earth is covered in water but in movies spaceships always crash on land", "text": ""},
{"title": "If Steve Jobs was reincarnated into a Chinese family he would be old enough to be making iphones now.", "text": ""},
{"title": "If Google Maps just said every trip is 10% longer than it is people would be on time to things so much more frequently", "text": ""},
{"title": "We've stepped on the moon. We've landed robots on Mars. But we still haven't mastered that awkward delay between studio anchor and field reporter.", "text": ""},
{"title": "Searching for a Google image of something and getting a Pinterest result is just basically saying \"Guess we're not looking at that one today\"", "text": ""},
{"title": "If you speak with a lot of slang and profanity in your native language, you don't speak the language very well. If you speak with a lot of slang and profanity in a second language, you speak the language excellently.", "text": ""},
{"title": "True friendship is when you un-floop your dogs ears, so they don’t have to shake their heads.", "text": ""},
{"title": "When someone in your neighborhood is having a BBQ, it must be the same feeling when sharks smell blood in the water.", "text": ""},
{"title": "\"Probiotic\" sounds a lot better than \"bacteria infested\"", "text": "Edit:\nTo everyone saying it's not really \"infested:\" https://i.imgur.com/gRk1uZm.gif"},
{"title": "The new credit card chip readers should play a pleasant sound to notify that your card is approved. The harsh buzzing noise they make gives me a mini panic attack every time thinking my card was declined.", "text": ""},
{"title": "The craziest prediction that the tv show \"The Jetsons\" made about life that far in the future was that a man could still support a middle class family of 4 by working in a factory.", "text": ""},
{"title": "If someone told me to transport a $30,000 object that, if mishandled, could kill everyone around it, I would walk it so slowly and carefully to its destination. But I drive my car with one hand, while messing with the radio, going 70 mph.", "text": ""},
{"title": "Your belly button is just your old mouth.", "text": ""},
{"title": "In my life I've purchased at least 50 cans of WD40, right now I can locate two, I've never thrown one away, and I have no idea where the rest went", "text": ""},
{"title": "What if over time the developers of Pokémon GO slowly reduce Pokémon spawn rates to zero, and the app turns out to be a publicity stunt to warn about the dangers of over hunting and extinction.", "text": ""},
{"title": "Hospital food probably tastes so bad because it doesn’t have absurd amounts of butter and salt.", "text": ""},
{"title": "A Batman movie from the point of view of a random street gang would probably be a lot like the film \"Predator\"", "text": "well shit, i come home 7 hours later half drunk and this exploded, sorry I couldn't reply to you guys in a timely manner at all"},
{"title": "Sneezing is like using sonar to find polite people.", "text": "It works. "},
{"title": "Notice how the friends that never text you back are the ones always on their phones when you see them", "text": ""},
{"title": "If you don't drink alcohol because you have recovered from alcoholism you're admired, but if you don't drink and never have, you're weird.", "text": ""},
{"title": "Only once you've written up the entire angry paragraph you realize shamefully that nobody gives a fuck.", "text": ""},
{"title": "People would be a lot more willing to rate apps if they didn't have to switch apps to do so.", "text": ""},
{"title": "A tie is just a big arrow pointing at your genitals.", "text": ""},
{"title": "Changing a baby’s diaper would be 1000 times worse if they had pubes and a hairy ass.", "text": ""},
{"title": "Earlier people used to write personal stuff in their diaries and get mad when people read them. Now people write personal stuff on social media and get mad when people DON'T read them.", "text": ""},
{"title": "\"Autocorrect\" should be named \"Autoassume\". It doesn't know if the changes are correct.", "text": ""},
{"title": "When I get in my car, I'm always surprised how loud I liked to listen to music yesterday.", "text": ""},
{"title": "Surgery is stabbing someone to life.", "text": ""},
{"title": "By now Stacey IS the mom that has it going on.", "text": ""},
{"title": "My 15 year old self would be appalled to hear how many times I've chosen sleep over sex.", "text": ""},
{"title": "We make fun of people Instagramming their food, but lest we forget that, during the Renaissance, lots of artists were just painting bowls of fruit.", "text": ""},
{"title": "Students who try hard in high school grow up wishing they had fun, but students who only had fun in high school grow up wishing they tried.", "text": ""},
{"title": "The person you’ve communicated with most is yourself, via your internal monologue", "text": ""},
{"title": "I find strangers attractive because they haven't pissed me off yet", "text": ""},
{"title": "Mastrubating to your SO is as loyal as a relationship goes", "text": ""},
{"title": "If fossil fuels will eventually cause human extinction, but some birds survive, then dinosaurs will have evolutionarily outwitted us with the longest shot imaginable.", "text": ""},
{"title": "In the tv series Supernatural nothing in that universe is supernatural since all the things they encounter are observable, quantifiable and exist as part of the natural structure of the world.", "text": ""},
{"title": "Best thing about the Panama Papers scandal so far is that its name doesn't end in \"gate\".", "text": ""},
{"title": "You know you're getting older when you transition from not having enough money to buy games to not having enough time to play all the games you bought", "text": ""},
{"title": "Spicy food is like BDSM for your mouth", "text": ""},
{"title": "The reason why tomato soup and grilled cheese is such a good combo is because it's basically the same ingredients as pizza.", "text": "Edit: thanks for the love. I am also obligated to point out the fact that lasagna is also the same. Carry on"},
{"title": "Deadpool is the perfect replacement for Stan Lee as the go-to cameo guy once the latter passes away.", "text": ""},
{"title": "Most of the adult life feels like a game you were hyped about in childhood but when released you were disappointed because the trailer was better than the actual game.", "text": ""},
{"title": "Your future self is watching you right now through memories.", "text": ""},
{"title": "Tapes had \"A\" and \"B\" sides so it only made sense to transition to \"CDs\"", "text": ""},
{"title": "In high school, I fantasized about freezing time to touch girls' boobs. That means I had more faith in me being able to stop time than being able to make a girl like me.", "text": ""},
{"title": "An hourglass has more moving parts than a complicated wristwatch.", "text": ""},
{"title": "We should have a holiday called Space Day, where lights are to be shut off for at least an hour at night to reduce light pollution, so we can see the galaxy.", "text": "EDIT: Thanks for the gold! You took my gold virginity! :)"},
{"title": "If you go to Walmart and you don't see any weird people, does that make YOU the weird person?", "text": ""},
{"title": "I just had a fajita wrap from Tim Hortons in New Jersey. That's Mexican food from a Canadian restaurant in the United States. I just ate North America.", "text": ""},
{"title": "I'm not really scared of dying, I'm more bummed about all of the technology I'll never get to see.", "text": ""},
{"title": "All dogs are therapy dogs. The majority of them are just freelancing.", "text": ""},
{"title": "Managers should have to get letters of recommendation from the people below them before moving up to a higher position", "text": ""},
{"title": "Star Wars took place way in the past, really far away, but we are seeing it now because of how long it took for the light to reach us.", "text": ""},
{"title": "The older I get, the more concerned I am that every new ache and pain is going to be permanent", "text": ""},
{"title": "In my life I've bought at least 20 pairs of nail clippers because I lost the last pair, but I never take them out of my house meaning there's at least 19 places I haven't seen in my own house", "text": ""},
{"title": "Adding an \"e\" to the end of a word makes it seem old, but adding one to the beginning makes it sound high-tech.", "text": "Like \"e-mail\", or \"maile\". I don't know where I'm going with this."},
{"title": "If identical twin sisters become pregnant from the same guy then their kids will be full siblings genetically speaking.", "text": "**Update 1**\n\nThis thing blew up and it is unlikely that I'll be able to reply more comments but let me address some of the most common questions/replies I received.\n\n* I'm not from Alabama (whatever that means).\n\n* I was referring to monozygotic (identical) twins and, if claim is accurate, then it would also apply for identical male twins with a unique female partner for reproduction. In this setting offspring output would be in-series, though.\n\n* I was not implying that children will be identical (read again). ELI5: The large majority of siblings with same biological parents (full siblings) are not identical, but they share (on average) 50% DNA. This 50% sharing can happen with the setting the post described.\n\n* As pointed out below it gets weirder when two sets of identical twins form two couples. We can take it a step further, if any of this is truth, generalizing for monozygotic twins, triplets, etc.\n\n* For every comment I got saying it was an obvious/silly remark I received another one saying that I failed basic HS biology. In an attempt to confirm the validity of this claim I approached a colleague that works on this topic for a living. This person came back with an unsatisfyingly complicated \"yes but no\" answer that I will not replicate here. I will update this post if I learn a more concise explanation, but for now it would be safe to assume that it is possible to tell children's twin parents apart beyond traditional DNA testing.\n\n* A lot of comments below provide TMI but please keep it civil.\n\n* Go upvote some other post because it's weird this made it to the top of the sub."},
{"title": "The only negative thing about nicer weather is losing all that pocket storage from your jacket.", "text": ""},
{"title": "Every time I find a new favorite song and eagerly check out the artist/band for more, it turns out that's the one song that's different from the whole rest of their career", "text": ""},
{"title": "Reddit is like my fridge. After the fifth time opening it I know everything that's in there, but I keep finding myself opening it in the hopes of something new.", "text": ""},
{"title": "\"DO NOT TOUCH\" would probably be a really unsettling thing to read in braille.", "text": ""},
{"title": "As a kid, carnival rides are scary because they’re fast. As an adult, carnival rides are scary because you’re worried about their maintenance.", "text": ""},
{"title": "If bread goes bad we throw it away, If bananas go bad we make bread out of them", "text": ""},
{"title": "I'm lucky enough to live in a country where if I hear an air raid siren I expect it to be followed by phat bass and a banging tune.", "text": "Thanks for the showerthought inspiration; \n\nhttps://www.reddit.com/r/videos/comments/4mx4q7/in_my_opinion_still_the_most_impressive_video_of/\n\nObligatory front page edit: You're all Phat and Banging."},
{"title": "If Google matched people up by their browsing history, it could be the greatest online dating website of all time.", "text": "Edit: shweet\n\nEdit 2: I don't necessarily mean matching with the someone with the same history. It might be a little weird dating yourself. I assume there would be some system to figure out the best match. Idk they're Google they'd figure it out"},
{"title": "Jello is just boneless bones", "text": ""},
{"title": "Cops are like spiders. They prevent bad things, but no one wants them around. People are scared of them. Most mind their business and do their job - but the few which are threatening terrify us.", "text": "Creepy.\n\nEdit: Creepy.\n\nEdit 2: Creepy."},
{"title": "You can't judge a book by its cover, but you can judge a YouTuber by their video thumbnails", "text": ""},
{"title": "The leather jacket I've been wearing for 10 years has been worn longer by me than the cow that it came from.", "text": ""},
{"title": "Earth is like a guy who knows exactly where to stand next to a bonfire.", "text": ""},
{"title": "Task Manager should have an \"End as many tasks as possible without crashing my system\" button", "text": ""},
{"title": "At the age of 28, my expected lifetime remaining is around 63%. When I see my phones battery at 63%, I feel like its almost dead.", "text": ""},
{"title": "Conspiracy theories make dumb people feel smart.", "text": ""},
{"title": "In western cartoons the main character is in love with the prettiest girl in school and she will never like him. In anime the prettiest girl in school is in love with the main character and the main character is too dumb to notice.", "text": ""},
{"title": "Wolverine could just keep throwing his severed dicks at you until you give up and run away", "text": "Edit for the mandatory:  Thanks for the gold kind stranger "},
{"title": "When your GPA is low, it’s an indicator that you may not be cut out for the job you want. But when it’s high, it “doesn’t matter in the real world.”", "text": ""},
{"title": "The fact that Romeo and Juliet’s love is so idealised shows how few people have read the play.", "text": ""},
{"title": "A magical mirror that showed an oppositely gendered, equally attrative version of one's self could be very insightful", "text": "probably wouldn't be healthy, especially if made into a snapchat effect/filter."},
{"title": "Urban Dictionary will probably be a useful tool for future historians so they can actually figure out what we're saying.", "text": ""},
{"title": "As an adult, I no longer masturbate because I'm horny. It's either to relieve stress or because im bored.", "text": ""},
{"title": "\"Millennials\" is a way for old people today to say \"kids these days\" without sounding like their cringy, grumpy old people from the past who kept saying \"kids these days\"", "text": ""},
{"title": "We always say \"stupid autocorrect\" but never give it positive feedback for the 97% of the work it does.", "text": "And for that I'd like to say, goid job autocorrect! "},
{"title": "It would be a good idea to have \"The Price Is Right\" with billionaires, just to see how out of touch they are.", "text": ""},
{"title": "It’s socially acceptable to talk about how reliant and addicted you are to a drug as long as that drug is caffeine.", "text": ""},
{"title": "If I eat my meal from the frying pan at a restaurant, it's sophisticated and a sign of quality. If I do it at home, I'm lazy and disgusting.", "text": ""},
{"title": "If God really wanted to troll us, He could have made the moon transparent so it acted like a lens, and put Earth at its focal point. Then whenever an eclipse happened, it would scorch a path across the planet.", "text": "Edit: Wow! First time on FP, and I'm pretty new here. So many thanks!"},
{"title": "In highschool, eating lunch alone is considered lame and can result in bullying. In a busy office, eating lunch alone and undisturbed is considered a luxury.", "text": ""},
{"title": "The skeleton isn't inside you, you're the brain so you're inside the skeleton.", "text": ""},
{"title": "Cinemas should play a clip with someone saying \"OK Google, Silencio! Hey Siri, adjust volume to zero percent!\" before the movie starts.", "text": ""},
{"title": "We tend to romanticize the poor who are geographically far away from us and demonize the poor who are nearby.", "text": ""},
{"title": "I'm so conditioned to not use Fire Exits, I'm not sure I'd think to use one during an actual fire.", "text": "Thanks for all the comments people! I didn't realize this was such a 'hot' topic...if nothing else we should take a minute to re-educate kids etc to use common sense in these situations. Obviously all of our fire drills haven't taught us anything. "},
{"title": "A true mad scientist would only destroy half of the earth, since the other half is the control group.", "text": ""},
{"title": "As a dwarf/little person, I'm very grateful that I am neither ginger nor Irish on this day", "text": ""},
{"title": "Putting files on your desktop is the digital equivalent of throwing clothes on your chair", "text": ""},
{"title": "There should be affordable universities for people who just want to continue learning throughout life. Not to get a degree, or a better job; just a place to learn, foster ideas and meet others who are doing the same.", "text": ""},
{"title": "Timmy Turner's reply \"uh... internet?\" when his parents ask him where he got wish-based things has become more believable over time.", "text": ""},
{"title": "Exercising your personal right to not get vaccinated is like exercising your personal right to drink and drive. In both cases, you're not only going to end up killing yourself, you're going to kill other people too.", "text": ""},
{"title": "In the next 20 years everything on r/aww will most likely be dead", "text": ""},
{"title": "Randomly Hearing your favorite song on the radio is more satisfying than playing it directly from your ipod.", "text": ""},
{"title": "If immortality becomes a thing... I'm going to quit my job and become a divorce attorney.", "text": "Edit: So people keep suggesting the book The Postmortal by Drew Magery. Great minds think alike so I can only conclude the author is a great writer and the book is a great read. So read it! Not just because of its high reviews but also because of, well you know, peer pressure..."},
{"title": "Negative thoughts are like fat, it takes a long time to get rid of it and only a short time to gain it back.", "text": ""},
{"title": "Movie theaters should charge babies as adults to deter people from bringing them.", "text": ""},
{"title": "All the adult vikings in \"How to Train Your Dragon\" have Scottish accents, the teenagers have Midwestern accents, and the movie takes place in Scandinavia. Gobber is the only one with a proper accent.", "text": ""},
{"title": "If my calculator had a history, it would be more embarrassing than my browser history.", "text": ""},
{"title": "When someone says 'I miss you!', I think, well, that's nice. But if they take off the exclamation point I think, wow, they must really miss me.", "text": ""},
{"title": "Technically all chess is 4D chess because it's being played over time", "text": ""},
{"title": "The first immortal creature will probably be a lab rat", "text": ""},
{"title": "There could have been a moment in history were every single human blinked at the same time, but no one noticed as no one saw it.", "text": ""},
{"title": "If you had $1 for every year the universe has existed (approximately 13.8 billion years). You wouldn't even make the top 50 on the Forbes list.", "text": ""},
{"title": "The creator of Photoshop could've had a lot of fun if he did not tell anyone.", "text": ""},
{"title": "Have we as a species just universally agreed that Snoop Dogg can hit a blunt whenever and wherever he wants?", "text": ""},
{"title": "Theme parks can snap a crystal clear picture of you on a roller coaster at 70 mph, but bank cameras can't get a clear shot of a robber standing still.", "text": ""},
{"title": "When my text alert sounds I get excited. When my phone rings I think I'm in deep shit and panic.", "text": ""},
{"title": "If Apple owned the ISS it would spell disaster for other spacecraft that wanted to dock with it.", "text": ""},
{"title": "Commuters probably get stuck in traffic with roughly the same group of people every day, just in a different order.", "text": ""},
{"title": "If we lose one sock in the wash we get annoyed, but if we lost two socks we would never know.", "text": ""},
{"title": "Punishment for honesty is what makes us lie.", "text": ""},
{"title": "Cell phones have greatly reduced bathroom graffiti", "text": ""}
]
